[
  {
    "Friendly name": "newarmor",
    "description": "Armor nbr should be a number between 300 and 999. It must not be the same as any other armor. This new armor will be affected by the following modding commands and there should be an #end command at the end."
  },
  {
    "Friendly name": "newevent",
    "description": "This command creates a new event. All subsequent commands will modify this event until modding the event is finished with the #end command."
  },
  {
    "Friendly name": "newitem",
    "description": "Creates a new magic item and selects it for modding by the following commands. End modding the magic item with the #end command."
  },
  {
    "Friendly name": "newmerc",
    "description": "Creates a new mercenary band. Always end modifying it with an #end command."
  },
  {
    "Friendly name": "newmonster",
    "description": "Monster nbr should be a number between 3500 and 8999. It must not be the same as any other monster. This new monster will be affected by the following modding commands and there should be an #end command at the end. It is not necessary to set a monster number when creating a new monster. It is not recommended to use a monster number with monsters that have unique names like Sorceress of the Sacred Fire because that will reduce the risk of conflicts between mods. If a monster number is not used, Dominions will automatically use the first free number from 3500+ for the monster. In this instance all references to the monster in other modding (such as spells or magic sites) must be by name. Using lower hard coded numbers later in the mod may overwrite the number initially assigned by a numberless #newmonster command."
  },
  {
    "Friendly name": "newnation",
    "description": "This command can be used to add a new nation instead of #selectnation. The command automatically uses the first free nation number of 120 or higher that is available. Always use #end command at the end of modifying a nation."
  },
  {
    "Friendly name": "newsite",
    "description": "Site nbr (optional) should be a number between 1500 and 1998. It must not be the same as any other site. This new site will be affected by the following modding commands and there should be an #end command at the end."
  },
  {
    "Friendly name": "newspell",
    "description": "Creates a new spell and selects it for modding by the following commands. End creating the spell with the #end command."
  },
  {
    "Friendly name": "newweapon",
    "description": "Weapon number for new weapons should be a number between 800 and 1999. It must not be the same as any other weapon. This new weapon will be affected by the following modding commands and there should be an #end command at the end."
  },
  {
    "Friendly name": "selectarmor",
    "description": "Selects the armor that will be affected by the following modding commands. End modding this armor with the #end command. To find out what the number of a particular unit’s armor, look at the unit’s stats in the game and press ctrl+i."
  },
  {
    "Friendly name": "selectitem",
    "description": "Selects the magic item that will be affected by the following modding commands. End modding this item with the #end command. In the game you can press shift+i when viewing a magic item to see what number it has. Use numbers 500 – 999 for modding."
  },
  {
    "Friendly name": "selectnametype",
    "description": "Selects the nametype that will be affected by the following modding commands. Nametype nbr is a number between 100 and 200. See hover for nametype table. Numbers 127 and 128 as well as numbers 165 – 299 can be used to make your own name tables without altering existing ones.  Always #end command at the end of modifying a nametype."
  },
  {
    "Friendly name": "selectmonster",
    "description": "Selects the monster that will be affected by the following modding commands. End modding this unit with the #end command. To find out what number a particular unit has, look at his stats in the game and press ctrl+i."
  },
  {
    "Friendly name": "selectnation",
    "description": "Selects the nation that will be affected by the following modding commands. End modding this nation with the #end command. Nation number is a number between 5 and 249. See hover tables for currently used numbers.  Always #end command at the end of modifying a nametype.You can use number 120 to 249 in order to create new nations without overwriting an existing one. Numbers 0 – 4 are used for various independents and temporary monsters in the game and cannot be used for modding. Always #end command at the end of modifying a nametype."
  },
  {
    "Friendly name": "selectpoptype",
    "description": "Selects the poptype that will be affected by the following modding commands. See hover table for poptype numbers. End modding this poptype with the #end command."
  },
  {
    "Friendly name": "selectsite",
    "description": "Selects the magic site that will be affected by the following modding commands. End modding this site with the #end command."
  },
  {
    "Friendly name": "selectspell",
    "description": "Selects an existing spell that will be affected by the following modding commands. End modding this spell with the #end command."
  },
  {
    "Friendly name": "selectweapon",
    "description": "Selects the weapon that will be affected by the following modding commands. End modding this weapon with the #end command. To find out the numbers of a particular unit’s weapons, look at the unit’s stats in the game and press ctrl+i."
  },
  {
    "Friendly name": "10d6units",
    "description": "The nation that owns the event gains 10d6 units."
  },
  {
    "Friendly name": "11d6units",
    "description": "The nation that owns the event gains 11d6 units."
  },
  {
    "Friendly name": "12d6units",
    "description": "The nation that owns the event gains 12d6 units."
  },
  {
    "Friendly name": "13d6units",
    "description": "The nation that owns the event gains 13d6 units."
  },
  {
    "Friendly name": "14d6units",
    "description": "The nation that owns the event gains 14d6 units."
  },
  {
    "Friendly name": "15d6units",
    "description": "The nation that owns the event gains 15d6 units."
  },
  {
    "Friendly name": "16d6units",
    "description": "The nation that owns the event gains 16d6 units."
  },
  {
    "Friendly name": "1d3units",
    "description": "The nation that owns the event gains 1d3 units."
  },
  {
    "Friendly name": "1d3vis",
    "description": "Gain 1d3 gems of specified type."
  },
  {
    "Friendly name": "1d6units",
    "description": "The nation that owns the event gains 1d6 units."
  },
  {
    "Friendly name": "1d6vis",
    "description": "Gain 1d6 gems of specified type."
  },
  {
    "Friendly name": "1unit",
    "description": "The nation that owns the event gains one unit."
  },
  {
    "Friendly name": "2com",
    "description": "The nation that owns the event gains two commanders of the specified type."
  },
  {
    "Friendly name": "2d3units",
    "description": "The nation that owns the event gains 2d3 units."
  },
  {
    "Friendly name": "2d4vis",
    "description": "Gain 2d4 gems of specified type."
  },
  {
    "Friendly name": "2d6units",
    "description": "The nation that owns the event gains 2d6 units."
  },
  {
    "Friendly name": "2d6vis",
    "description": "Gain 2d6 gems of specified type."
  },
  {
    "Friendly name": "3d3units",
    "description": "The nation that owns the event gains 3d3 units."
  },
  {
    "Friendly name": "3d6units",
    "description": "The nation that owns the event gains 3d6 units."
  },
  {
    "Friendly name": "3d6vis",
    "description": "Gain 3d6 gems of specified type."
  },
  {
    "Friendly name": "4com",
    "description": "The nation that owns the event gains four commanders of the specified type."
  },
  {
    "Friendly name": "4d3units",
    "description": "The nation that owns the event gains 4d3 units."
  },
  {
    "Friendly name": "4d6units",
    "description": "The nation that owns the event gains 4d6 units."
  },
  {
    "Friendly name": "4d6vis",
    "description": "Gain 4d6 gems of specified type."
  },
  {
    "Friendly name": "5com",
    "description": "The nation that owns the event gains five commanders of the specified type."
  },
  {
    "Friendly name": "5d6units",
    "description": "The nation that owns the event gains 5d6 units."
  },
  {
    "Friendly name": "6d6units",
    "description": "The nation that owns the event gains 6d6 units."
  },
  {
    "Friendly name": "7d6units",
    "description": "The nation that owns the event gains 7d6 units."
  },
  {
    "Friendly name": "8d6units",
    "description": "The nation that owns the event gains 8d6 units."
  },
  {
    "Friendly name": "9d6units",
    "description": "The nation that owns the event gains 9d6 units."
  },
  {
    "Friendly name": "acid",
    "description": "This weapon does acid damage. Acid weapons can damage armor. Damaged armor will break if subjected to more blows but will be repaired if there are enough resources in the province the monster is in."
  },
  {
    "Friendly name": "aciddigest",
    "description": "The monster digests any swallowed creatures and causes their armor to be weakened like the Rust Mist spell."
  },
  {
    "Friendly name": "acidshield",
    "description": "Anyone striking this monster will take"
  },
  {
    "Friendly name": "addequip",
    "description": "Adds magic items to a commander. Equipment level is from 1 to 4 and corresponds to item level from trinkets to very powerful items. Use the value 9 for equipment level and a bracketed [item name] in the #msg text to add a specific magic item. An item is not guaranteed at equipment level 1. The command also gives the commander gems appropriate to his magic paths."
  },
  {
    "Friendly name": "addforeigncom",
    "description": "This commander can only be recruited in provinces with no fort."
  },
  {
    "Friendly name": "addforeignunit",
    "description": "This unit can only be recruited in provinces with no fort."
  },
  {
    "Friendly name": "addgod",
    "description": "Adds this monster as a god to the nations list of valid gods. The monster must have the #startdom and #pathcost commands set. If the monster does not have a defined homerealm this command is the only way to add it as a god."
  },
  {
    "Friendly name": "addname",
    "description": "Adds a name to the selected nametype."
  },
  {
    "Friendly name": "addrandomage",
    "description": "Makes the monster start 1 to years (a random die) older."
  },
  {
    "Friendly name": "addreccom",
    "description": "Adds a commander to the recruitment list."
  },
  {
    "Friendly name": "addrecunit",
    "description": "Adds a unit to the recruitment list."
  },
  {
    "Friendly name": "addsite",
    "description": "Adds a new, already discovered site to the province. Use -1 for site number to place [sitename] instead. [Sitename] must be added to event message text in brackets."
  },
  {
    "Friendly name": "addupkeep",
    "description": "Upkeep will be calculated as if the unit cost this much more to recruit."
  },
  {
    "Friendly name": "adventureruin",
    "description": "A commander who enters the ruin has a chance to discover gold gems magic items or other rewards. Those who fail may fall victim to lethal traps or bloodthirsty monsters."
  },
  {
    "Friendly name": "aiairnation",
    "description": "Hint to AI that Air magic is used a lot in this nation and that an air god is probably good."
  },
  {
    "Friendly name": "aiastralnation",
    "description": "Hint to AI that Astral magic is used a lot in this nation and that an astral god is probably good."
  },
  {
    "Friendly name": "aiawake",
    "description": "When playing this nation the AI will have this much extra chance of choosing an awake pretender."
  },
  {
    "Friendly name": "aibadlvl",
    "description": "The spell AI will never choose this spell if is is level or higher in the required magic path."
  },
  {
    "Friendly name": "aibloodnation",
    "description": "Hint to AI that Blood magic is used a lot in this nation and that a blood god is probably good."
  },
  {
    "Friendly name": "aicheapholy",
    "description": "Informs the AI that this nation has cheap expendable sacred units. So a Charge Body bless effect or something similar could be appropriate. Marignon and Mictlan has this hint."
  },
  {
    "Friendly name": "aideathnation",
    "description": "Hint to AI that Death magic is used a lot in this nation and that a death god is probably good."
  },
  {
    "Friendly name": "aiearthnation",
    "description": "Hint to AI that Earth magic is used a lot in this nation and that a earth god is probably good."
  },
  {
    "Friendly name": "aifirenation",
    "description": "Hint to AI that Fire magic is used a lot in this nation and that a fire god is probably good."
  },
  {
    "Friendly name": "aigoodbless",
    "description": "Use to increase the chance of creating a powerful bless. 100=only do gods with a powerful bless effects for this nation."
  },
  {
    "Friendly name": "aiholdgod",
    "description": "When playing this nation the AI will never leave the home province with the pretender."
  },
  {
    "Friendly name": "aiholyranged",
    "description": "Informs the AI that this nation has sacred ranged units. So a Wind Guide bless or something similar could be appropriate."
  },
  {
    "Friendly name": "aimusthavemag",
    "description": "Makes AI pretender have at least 3 in this magic school. Only one of these possible per nation."
  },
  {
    "Friendly name": "ainaturenation",
    "description": "Hint to AI that Nature magic is used a lot in this nation and that a nature god is probably good."
  },
  {
    "Friendly name": "ainocast",
    "description": "The spell AI will never select this spell unless it has been scripted. Use this for spells like Returning that should normally never be cast."
  },
  {
    "Friendly name": "ainorec",
    "description": "Will tell the AI to never recruit this monster."
  },
  {
    "Friendly name": "airattuned",
    "description": "Chance of getting a bonus level of magic when transformed into this being.  In place of [path] insert the name of the magic path in all lower case for the correct command (#fireattuned #airattuned etc)."
  },
  {
    "Friendly name": "airblessbonus",
    "description": "Gods of this nation will get extra bless design points of this type."
  },
  {
    "Friendly name": "airboost",
    "description": "One commander determined by target requirements or the monster number may gain +1 Air magic."
  },
  {
    "Friendly name": "airrange",
    "description": "All Air rituals cast in this province have their range increased by"
  },
  {
    "Friendly name": "airshield",
    "description": "The monster gains the airshield special ability."
  },
  {
    "Friendly name": "aisinglerec",
    "description": "Will tell the AI to only recruit a single one of these per batch."
  },
  {
    "Friendly name": "aispellmod",
    "description": "This modifies the spell AI to (dis)like this spell. Usually there is no need for this command. A value of -100 makes it never be cast and a value of 100 makes it twice as likable for the spell AI."
  },
  {
    "Friendly name": "aiwaternation",
    "description": "Hint to AI that Water magic is used a lot in this nation and that a water god is probably good."
  },
  {
    "Friendly name": "alchemy",
    "description": "The monster is more efficient when casting spells the converts gems into gold. A typical Alchemist has a value of 50."
  },
  {
    "Friendly name": "allies",
    "description": " These two players will not attack each other. This command will only affect computer players."
  },
  {
    "Friendly name": "allowedplayer",
    "description": " Makes this nation one of the allowed nations to play on this map. Use this command multiple times or the map will only be able to host one player. Nation numbers can be found in the tables below. This command can be used to make era specific maps."
  },
  {
    "Friendly name": "allrange",
    "description": "All magic rituals cast in this province have their range increased by"
  },
  {
    "Friendly name": "allret",
    "description": "Extra chance of returning from any of the other planes a monster can be banished to."
  },
  {
    "Friendly name": "almostliving",
    "description": "Unit will require not undead leadership to lead even though it is undead. This command must come after the #undead command."
  },
  {
    "Friendly name": "almostundead",
    "description": "Unit will require undead leadership to lead even though it isnt an undead or a demon."
  },
  {
    "Friendly name": "altcost",
    "description": "All rituals of the Alteration school cast in this province cost"
  },
  {
    "Friendly name": "ambidextrous",
    "description": "This monster gets reduced attack penalty when using two weapons. A normal value is 2 or 3."
  },
  {
    "Friendly name": "ammo",
    "description": "This is the number of times that this weapon can be fired in combat. The default value is 12. The maximum value is 30."
  },
  {
    "Friendly name": "amphibian",
    "description": "This monster can travel both under and over water."
  },
  {
    "Friendly name": "animal",
    "description": "Indicates that the monster is an animal. Animals are affected by the Animal Awe power. Animals receive a morale bonus when led to combat by a beast master."
  },
  {
    "Friendly name": "animalawe",
    "description": "Bonus can be a value of one or more. A bonus of one means that animals with a morale of 11 have about 50% chance of daring to strike. A bonus of 10 means that you need a morale of 20 to get a 50% chance. Standard value is 1 (for Awe(+1) )."
  },
  {
    "Friendly name": "aoe",
    "description": "Sets the area of effect for this spell. Add 1000 to this value to give larger areas to more powerful casters. E.g. 1001 means area = 1+1/level of caster (area would be 2 for a level 1 mage). A value of 666 means that the entire battlefield is affected. 663 means that 50% of all squares are affected 665 = 25% 664 = 10% 662 = 5%."
  },
  {
    "Friendly name": "ap",
    "description": "The number of action points when the monster is unencumbered. This should be about 12 for a human 20 for a knight or 25 for light cavalry. Action points is the same as combat speed."
  },
  {
    "Friendly name": "aquatic",
    "description": "This monster can only live under water."
  },
  {
    "Friendly name": "arena",
    "description": "Opens the Area Death Match for competitors. Players will be able to send heroes to the arena this turn."
  },
  {
    "Friendly name": "armor",
    "description": "Defines what kind of armor if any the units gets when it uses the item. Use #armor 0 to clear an existing armor from a copied item."
  },
  {
    "Friendly name": "armornegating",
    "description": "The weapon is armor negating. Armor is completely ignored when determining damage."
  },
  {
    "Friendly name": "armorpiercing",
    "description": "The weapon is armor piercing. Armor protection is halved when determining damage."
  },
  {
    "Friendly name": "assassin",
    "description": "An assassin of this type attacks a random commander in the province. If a target requirement for the event is set, the assassin attacks that commander."
  },
  {
    "Friendly name": "assowner",
    "description": "The following assassins created by this event will be owned by this nation."
  },
  {
    "Friendly name": "astralattuned",
    "description": "Chance of getting a bonus level of magic when transformed into this being.  In place of [path] insert the name of the magic path in all lower case for the correct command (#fireattuned #airattuned etc)."
  },
  {
    "Friendly name": "astralblessbonus",
    "description": "Gods of this nation will get extra bless design points of this type."
  },
  {
    "Friendly name": "astralboost",
    "description": "One commander determined by target requirements or the monster number may gain +1 Astral magic."
  },
  {
    "Friendly name": "astralrange",
    "description": "All Astral rituals cast in this province have their range increased by"
  },
  {
    "Friendly name": "att",
    "description": "The item grants an attack bonus."
  },
  {
    "Friendly name": "autobless",
    "description": "This bearer of this item will be blessed automatically if it is sacred. Like the Flask of Holy Water magic item."
  },
  {
    "Friendly name": "autocompete",
    "description": "The bearer of this item will automatically compete in the Arena deathmatch."
  },
  {
    "Friendly name": "autodisgrinder",
    "description": "The monster automatically heals disease from"
  },
  {
    "Friendly name": "autodishealer",
    "description": "The monster automatically heals disease from"
  },
  {
    "Friendly name": "autohealer",
    "description": "The monster automatically heals"
  },
  {
    "Friendly name": "autospell",
    "description": "Makes the item cast this spell automatically in battle. It will only be cast once unless #autospellrepeat is also used."
  },
  {
    "Friendly name": "autospellrepeat",
    "description": "Makes an item cast its autospell every round of combat."
  },
  {
    "Friendly name": "autoundead",
    "description": "The nations Dominion automatically spawns undead like Ashen Empire Ermor."
  },
  {
    "Friendly name": "autumnshape",
    "description": "Changes into another monster when this season is active."
  },
  {
    "Friendly name": "awe",
    "description": "Bonus can be a value of one or more. A bonus of one means that people with a morale of 11 have about 50% chance of daring to strike. A bonus of 10 means that you need a morale of 20 to get a 50% chance. Standard value is 1 (for Awe(+1) ). 24"
  },
  {
    "Friendly name": "badindpd",
    "description": "This nation will not have national PD troops in any forted province except the home province."
  },
  {
    "Friendly name": "banefireshield",
    "description": "Anyone striking this monster will take"
  },
  {
    "Friendly name": "banished",
    "description": "One commander determined by target requirements is banished to another plane.  -11 = The Void -12 = Inferno -13 = Kokytos"
  },
  {
    "Friendly name": "barkskin",
    "description": "The item automatically applies the Barkskin spell to the bearer like the Barkskin Amulet."
  },
  {
    "Friendly name": "batmap",
    "description": " Sets the battleground that fights take place in for the current province. You can use the special name  empty  for no battleground"
  },
  {
    "Friendly name": "batstartsum1",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "batstartsum1d3",
    "description": "Summons 1d3 monsters at start of battle."
  },
  {
    "Friendly name": "batstartsum1d6",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "batstartsum2",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "batstartsum2d6",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "batstartsum3",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "batstartsum3d6",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "batstartsum4",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "batstartsum4d6",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "batstartsum5",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "batstartsum5d6",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "batstartsum6d6",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "batstartsum7d6",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "batstartsum8d6",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "batstartsum9d6",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "battlesum1",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "battlesum2",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "battlesum3",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "battlesum4",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "battlesum5",
    "description": "Summons x monsters at start of battle."
  },
  {
    "Friendly name": "beam",
    "description": "Beam weapon like dragon breath."
  },
  {
    "Friendly name": "beartattoo",
    "description": "Magic tattoo like the units of Marverni and Sauromatia have."
  },
  {
    "Friendly name": "beastmaster",
    "description": "All animals under the command of this monster have their morale increased by"
  },
  {
    "Friendly name": "beckon",
    "description": "Gives the monster the ability to lure enemy commanders like the Siren. The value indicates the difficulty of the morale check 10 is standard."
  },
  {
    "Friendly name": "bers",
    "description": "The bearer of the item will go berserk as soon as battle begins. Berserker Pelt has this attribute."
  },
  {
    "Friendly name": "berserk",
    "description": "This monster can go berserk like a barbarian chief or a minotaur. The bonus value will be added to strength and attack and subtracted from defense. It also increases encumbrance. A normal bonus value is 3."
  },
  {
    "Friendly name": "bird",
    "description": "Use this for birds rocs couatl and similar things."
  },
  {
    "Friendly name": "bless",
    "description": "The item automatically applies the Bless spell to the bearer like the Shroud of the Battle Saint."
  },
  {
    "Friendly name": "blessairshld",
    "description": "Blessed troops get Air Shield like from an Air bless. An existing Air bless is augmented."
  },
  {
    "Friendly name": "blessanimawe",
    "description": "Blessed troops get Animal Awe. An existing Animal Awe ability is augmented."
  },
  {
    "Friendly name": "blessatt",
    "description": "Blessed troops get increased Attack skill."
  },
  {
    "Friendly name": "blessawe",
    "description": "Blessed troops get Awe. An existing Awe ability is augmented."
  },
  {
    "Friendly name": "blessbers",
    "description": "Will make unit go berserk when blessed."
  },
  {
    "Friendly name": "blesscoldres",
    "description": "Blessed troops get increased Cold Resistance."
  },
  {
    "Friendly name": "blessdarkvis",
    "description": "Blessed troops get Darkvision. An existing Darkvision ability is augmented."
  },
  {
    "Friendly name": "blessdef",
    "description": "Blessed troops get increased Defense skill."
  },
  {
    "Friendly name": "blessdtv",
    "description": "Blessed troops get undying like the undying bless effect. An existing undying bless is augmented."
  },
  {
    "Friendly name": "blessfireres",
    "description": "Blessed troops get increased Fire Resistance."
  },
  {
    "Friendly name": "blessfly",
    "description": "Will grant the unit flying when blessed."
  },
  {
    "Friendly name": "blesshp",
    "description": "Blessed troops get increased Hit Points."
  },
  {
    "Friendly name": "blessmor",
    "description": "Blessed troops get increased Morale."
  },
  {
    "Friendly name": "blessmr",
    "description": "Blessed troops get increased Magic Resistance."
  },
  {
    "Friendly name": "blesspoisres",
    "description": "Blessed troops get increased Poison Resistance."
  },
  {
    "Friendly name": "blessprec",
    "description": "Blessed troops get increased Precision skill."
  },
  {
    "Friendly name": "blessreinvig",
    "description": "Blessed troops get increased Reinvigoration like from a bless with the same name. An existing reinvigoration bless is augmented."
  },
  {
    "Friendly name": "blessshockres",
    "description": "Blessed troops get increased Shock Resistance."
  },
  {
    "Friendly name": "blessstr",
    "description": "Blessed troops get increased Strength."
  },
  {
    "Friendly name": "blind",
    "description": "This monster has no eyes and cannot be affected by blindness."
  },
  {
    "Friendly name": "blink",
    "description": "Like #teleport but only in combat."
  },
  {
    "Friendly name": "bloodattuned",
    "description": "Chance of getting a bonus level of magic when transformed into this being.  In place of [path] insert the name of the magic path in all lower case for the correct command (#fireattuned #airattuned etc)."
  },
  {
    "Friendly name": "bloodblessbonus",
    "description": "Gods of this nation will get extra bless design points of this type."
  },
  {
    "Friendly name": "bloodboost",
    "description": "One commander determined by target requirements or the monster number may gain +1 Blood magic."
  },
  {
    "Friendly name": "bloodcost",
    "description": "All rituals of the Blood Magic school cast in this province cost"
  },
  {
    "Friendly name": "bloodnation",
    "description": "Makes the AI more likely to research blood magic and hunt for blood slaves. Mictlan has this hint."
  },
  {
    "Friendly name": "bloodrange",
    "description": "All Blood rituals cast in this province have their range increased by"
  },
  {
    "Friendly name": "bloodvengeance",
    "description": "The monster has the Blood Vengeance ability. Any creature that hits the monster must make a magic resistance check or suffer the same damage that it inflicts on its target. Strength works identically to #damagerev."
  },
  {
    "Friendly name": "blunt",
    "description": "The weapon does blunt damage. Monsters with Blunt Resistance only take half damage."
  },
  {
    "Friendly name": "bluntres",
    "description": "The monster takes half damage from blunt weapons."
  },
  {
    "Friendly name": "boartattoo",
    "description": "Magic tattoo like the units of Marverni and Sauromatia have."
  },
  {
    "Friendly name": "bodyguard",
    "description": "The monsters morale is increased by"
  },
  {
    "Friendly name": "bodyguards",
    "description": " Gives bodyguards to the active commander. This command only affects independents. AI nations will ignore this command."
  },
  {
    "Friendly name": "bonus",
    "description": "This is an intrinsic weapon that will not incur a multiple weapon penalty or get replaced when the commander is equipped with a magic weapon item."
  },
  {
    "Friendly name": "bonusspells",
    "description": "The monster gets the Innate Spellcaster ability and can cast a number of spells every combat round in addition to its normal attacks. The spellcasting cannot be interrupted or prevented by adjacent enemy units unlike normal spellcasting. A maximum value of 4 can be used but no unit in the standard game has more than 3."
  },
  {
    "Friendly name": "bossname",
    "description": "Name of the bands leader."
  },
  {
    "Friendly name": "bowstr",
    "description": "Only one third of the weapon wielders strength will be added to the damage. This is normally used for missile weapons like bows."
  },
  {
    "Friendly name": "brief",
    "description": "A very brief description for popups."
  },
  {
    "Friendly name": "bringeroffortune",
    "description": "A bringer of fortune has a percentage chance -100 to 100 to generate a good or bad (based on postitive or negative) random event in the province where it is located. Multiple units with this ability do stack, though the chances for each to generate an event are rolled independently, allowing for many such events to be generated each turn. This ability allows for bypassing the normal random event limit incurred by natural events."
  },
  {
    "Friendly name": "bug",
    "description": "Monsters with this tag are summoned by the Swarm spell on land."
  },
  {
    "Friendly name": "bugreform",
    "description": "This is a combat ability. When killed the monster will turn into a myriad of bugs and reform a little while later. The worm mage has this ability"
  },
  {
    "Friendly name": "buildcoastfort",
    "description": "The nation will build this type of fort in coastal provinces instead of the default one for their fortera."
  },
  {
    "Friendly name": "buildfort",
    "description": "The nation will build this type of fort instead of the default one for their fortera."
  },
  {
    "Friendly name": "builduwfort",
    "description": "The nation will build this type of underwater fort instead of the default one for their fortera."
  },
  {
    "Friendly name": "carcasscollector",
    "description": "The monster can turn  These commands grant other uncategorized magic abilities related to spells item forging and other planes of existence."
  },
  {
    "Friendly name": "castledef",
    "description": "Gives a castle defense bonus to the monster. The monster counts as"
  },
  {
    "Friendly name": "castleprod",
    "description": "Resource bonus for forts. Middle Era Ulm has 25 in this meaning they get 25% more resources in their fortified provinces than another nation with the same fort. Default is 0."
  },
  {
    "Friendly name": "casttime",
    "description": "Set the casting time of a spell the casting time is 100 for a standard spell. There is usually no need to set this value as Dominions will automatically give certain spells like battle enchantments higher casting time to fit in with all the other spells."
  },
  {
    "Friendly name": "cavecom",
    "description": "This commander can be recruited in cave provinces with or without fort. See the box below for all command names."
  },
  {
    "Friendly name": "cavenation",
    "description": "Sets the nations preference for starting in cave provinces.  0 = never start in caves 1 = can start in caves 2 = always start in a cave"
  },
  {
    "Friendly name": "caverec",
    "description": "This unit can be recruited in cave provinces with or without fort. See the box below for all command names."
  },
  {
    "Friendly name": "champprize",
    "description": "This item is given as a reward for winning the championship of the Arena deathmatch."
  },
  {
    "Friendly name": "chaospower",
    "description": "The monster will get stat increases or decreases depending on the Turmoil scale."
  },
  {
    "Friendly name": "chaosrec",
    "description": "The monster is cheaper to recruit if there are Turmoil scales in the province. The monster costs ["
  },
  {
    "Friendly name": "charge",
    "description": "The weapon will receive a damage bonus on its first attack. This bonus is proportional to the units maximum number of action points."
  },
  {
    "Friendly name": "cheapgod20",
    "description": "Nation can choose this god for 20 design points less."
  },
  {
    "Friendly name": "cheapgod40",
    "description": "Nation can choose this god for 40 design points less."
  },
  {
    "Friendly name": "chestwound",
    "description": "The item bearer suffers a Chest Wound affliction which cannot be healed until the item is removed."
  },
  {
    "Friendly name": "claim",
    "description": "The effects of magic site commands that appear after this command are not active until the throne is claimed by a god a disciple a prophet or a priest with Holy level 3 or higher."
  },
  {
    "Friendly name": "claimthrone",
    "description": "Any throne in the province is claimed by the event owner."
  },
  {
    "Friendly name": "cleanshape",
    "description": "The monster will heal all afflictions and hp if changing shape from secondshape to firstshape. This command must be applied to the monsters firstshape so for a werewolf the human form."
  },
  {
    "Friendly name": "clear",
    "description": "Clears the attributes of the selected magic site."
  },
  {
    "Friendly name": "clearallevents",
    "description": "This command removes all events from the game. You usually dont want to use this command."
  },
  {
    "Friendly name": "clearallitems",
    "description": "All forgeable magic items are removed from the game."
  },
  {
    "Friendly name": "clearallspells",
    "description": "All researchable spells are removed from the game."
  },
  {
    "Friendly name": "cleararmor",
    "description": "Removes all armor from the active monster. Must be used before assigning new armor or armor assignment does not work correctly."
  },
  {
    "Friendly name": "cleardef",
    "description": "Clears province defence units from the poptype."
  },
  {
    "Friendly name": "cleargods",
    "description": "Clears the list of pretender gods for this nation. The #clearnation command also does this. This command does not clear homerealm but #clearnation does. Homerealm gods must be removed with the #delgod command."
  },
  {
    "Friendly name": "clearmagic",
    "description": " Removes all magic skills from the active commander."
  },
  {
    "Friendly name": "clearmercs",
    "description": "Removes all mercenary bands."
  },
  {
    "Friendly name": "clearnation",
    "description": "Clears away all special settings for the nation like ideal cold reanimating priests underwater nation starting sites heroes pretender god list local defense fort type etc. The list of recruitable units and commanders is not cleared with this command."
  },
  {
    "Friendly name": "clearrec",
    "description": "Clears the recruitment list of all units and commanders."
  },
  {
    "Friendly name": "clearsites",
    "description": "Clears all start sites for this nation."
  },
  {
    "Friendly name": "clearspec",
    "description": "Removes all special abilities from the active monster. The special abilities are stuff like Holy Fire Resistance Awe etc."
  },
  {
    "Friendly name": "clearweapons",
    "description": "Removes all weapons from the active monster. Must be used before assigning new weapons or the monster will have both old and new weapons."
  },
  {
    "Friendly name": "cluster",
    "description": "Assigns a cluster value to a throne. A throne is likely to appear together with other thrones of same cluster value when a map is created. For example the Throne of Spring and the Throne of Autumn have the same cluster value and if one of them appears on the map the other is also very likely to appear. Cluster value can be a number from 1 to 32000."
  },
  {
    "Friendly name": "coastcom",
    "description": "This commander can be recruited in coast provinces with or without fort. See the box below for all command names."
  },
  {
    "Friendly name": "coastcom1",
    "description": "Add a unit to the list of recruitable commanders for this nation in coastal forts only."
  },
  {
    "Friendly name": "coastcom2",
    "description": "Add a unit to the list of recruitable commanders for this nation in coastal forts only."
  },
  {
    "Friendly name": "coastnation",
    "description": "The nations capital is in a coastal land province."
  },
  {
    "Friendly name": "coastrec",
    "description": "This unit can be recruited in coast provinces with or without fort. See the box below for all command names."
  },
  {
    "Friendly name": "coastunit1",
    "description": "Add a unit to the list of recruitable units for this nation in coastal forts only."
  },
  {
    "Friendly name": "coastunit2",
    "description": "Add a unit to the list of recruitable units for this nation in coastal forts only."
  },
  {
    "Friendly name": "coastunit3",
    "description": "Add a unit to the list of recruitable units for this nation in coastal forts only."
  },
  {
    "Friendly name": "code",
    "description": "Sets the event code of the current province (when planned for globals)"
  },
  {
    "Friendly name": "code2",
    "description": "Sets the eventcode of the current province (when executed for globals)"
  },
  {
    "Friendly name": "codedelay",
    "description": "Sets the event code of the current province, but not immediately. It will be set after all events have been executed this turn."
  },
  {
    "Friendly name": "codedelay2",
    "description": "Sets the event code of the current province, but not immediately. It will be set after all events have been executed on the next turn."
  },
  {
    "Friendly name": "cold",
    "description": "This monster is surrounded by cold like a Winter Wolf. The chill aura is"
  },
  {
    "Friendly name": "coldblood",
    "description": "Cold blooded like the lizards of Ctis."
  },
  {
    "Friendly name": "coldincome",
    "description": "The effect cold and heat have on income. Default is 5."
  },
  {
    "Friendly name": "coldpower",
    "description": "The monster will get stat increases or decreases depending on the Cold scale."
  },
  {
    "Friendly name": "coldrec",
    "description": "Cold scale requirement for recruitment."
  },
  {
    "Friendly name": "coldres",
    "description": "The item grants a Cold Resistance bonus."
  },
  {
    "Friendly name": "coldsupply",
    "description": "The effect cold and heat has on supplies. Default is 10."
  },
  {
    "Friendly name": "color",
    "description": "Each of the three colors is a number between 0.0 and 1.0. This color is used for the score graphs."
  },
  {
    "Friendly name": "com",
    "description": "The nation that owns the event gains a commander of the specified type."
  },
  {
    "Friendly name": "combatcaster",
    "description": "A combat caster has a 50% chance to attempt to cast spells over trying to attack in melee. Additionally, they have a halved chance of being interrupted when casting spells, and do not suffer double armor encumbrance for casting spells."
  },
  {
    "Friendly name": "command",
    "description": "Increases leadership value by this amount.  In addition to these commands a monster has magic leadership based on its magic paths (10 per level of Astral and 5 per level of any other magic than Death) These commands govern the level of undead leadership the monster possesses. Additionally undead leadership is increased by 15 points for each priest level if the priest serves a nation that can reanimate undead. The nations that have this benefit are Lanka Asphodel Sceleria Ermor (Ashen Empire) and Lemuria."
  },
  {
    "Friendly name": "commander",
    "description": " Puts one of these commanders in the active province. The commander will have a random name according to its nametype. This commander will be the active commander."
  },
  {
    "Friendly name": "commaster",
    "description": "The monster is automatically a communion master and does not need to cast the Communion Master spell to join a communion like the Trophimos Oppressors."
  },
  {
    "Friendly name": "comname",
    "description": " Replaces the active commanders random name with this one."
  },
  {
    "Friendly name": "computerplayer",
    "description": " This nation will always be controlled by the computer. Difficulty ranges from one to five. One is Easy AI. Two is Standard difficulty"
  },
  {
    "Friendly name": "comslave",
    "description": "The monster is automatically a communion slave and does not need to cast the Communion Slave spell to join a communion like the Theurg Communicant of Pythium in the middle era."
  },
  {
    "Friendly name": "conjcost",
    "description": "All rituals of the Conjuration school cast in this province cost"
  },
  {
    "Friendly name": "constcost",
    "description": "All rituals of the Construction school cast in this province cost"
  },
  {
    "Friendly name": "constlevel",
    "description": "Level of construction required to forge this item. This level can be 02468 or 12 for items that cannot be forged. To disable an item set this value to 12."
  },
  {
    "Friendly name": "copyarmor",
    "description": "Copies all stats from an existing armor. This command will overwrite all stats for the selected armor so it should be used as the first command after the #newarmor command."
  },
  {
    "Friendly name": "copyitem",
    "description": "Copies all stats from an existing item to the current item."
  },
  {
    "Friendly name": "copyspell",
    "description": "Copies all stats including name from the specified spell to the current spell."
  },
  {
    "Friendly name": "copyspr",
    "description": "Copies the sprite of the specified magic item to the current magic item."
  },
  {
    "Friendly name": "copystats",
    "description": "Copies all weapons armors stats magic skills and special abilities from an existing monster. The existing monster can be a monster that has been created previously in the mod. Copystats will overwrite all previous commands for the selected monster so it should be used as the first command after the #newmonster command."
  },
  {
    "Friendly name": "copyweapon",
    "description": "Copies all stats from an existing weapon. This command will overwrite all stats for the selected weapon so it should be used as the first command after the #newweapon command."
  },
  {
    "Friendly name": "corpseeater",
    "description": "The monster will eat this amount of corpses per month if possible and gain HP for it equal to the value in #deadhp."
  },
  {
    "Friendly name": "corpselord",
    "description": "This monster will receive extra units when creating Corpse Men. This ability will not be visible when inspecting the monster."
  },
  {
    "Friendly name": "crippled",
    "description": "The item bearer becomes Crippled. The affliction cannot be healed until the item is removed."
  },
  {
    "Friendly name": "crossbreeder",
    "description": "The monster is skilled in crossbreeding and gets a bonus when using the Crossbreeding or Improved Crossbreeding ritual from the Blood magic school. The crossbreeder receives more units per casting and a higher chance of extraordinary results."
  },
  {
    "Friendly name": "curse",
    "description": "Every unit in the province has this chance of being cursed."
  },
  {
    "Friendly name": "cursed",
    "description": "The item is cursed and cannot be dropped."
  },
  {
    "Friendly name": "curseluckshield",
    "description": "Grants the Fateweaving ability. Anyone striking the unit will have their fate rewritten and suffer from misfortunes for the next few rounds of battle. The effect can be resisted with a successful Magic Resistance check. The penetration bonus makes the effect harder to resist."
  },
  {
    "Friendly name": "custommagic",
    "description": "Gives a chance for another magic skill to the active monster. The path mask must be a number from Table 18 or a sum of multiple masks from this table."
  },
  {
    "Friendly name": "damage",
    "description": "Set the damage for this spell. Add 1000 to dmg to make the damage be variable with the level of the caster. Damage means damage for damage spells but it can also mean many other things for different spells. E.g. summoning spells use this value to determine which monster is summoned."
  },
  {
    "Friendly name": "damagemon",
    "description": "Use this to set a spells damage to a monster if you dont know its number."
  },
  {
    "Friendly name": "damagerev",
    "description": "The monster has the Damage Reversal ability. Any creature that hits the monster must make a magic resistance check or suffer the damage itself instead of harming the target. Strength must be at least one and strength minus one is the penalty to the MR check. Use strength 1 for standard damage reversal with no penalty."
  },
  {
    "Friendly name": "darkpower",
    "description": "The monster will get stat increases in darkness. Only active in combat."
  },
  {
    "Friendly name": "darkvision",
    "description": "Gives monster darkvision lessening penalties for fighting under darkness. Use value 100 for perfect darkvision."
  },
  {
    "Friendly name": "deadhp",
    "description": "Number of HP gained per corpse eaten."
  },
  {
    "Friendly name": "deathattuned",
    "description": "Chance of getting a bonus level of magic when transformed into this being.  In place of [path] insert the name of the magic path in all lower case for the correct command (#fireattuned #airattuned etc)."
  },
  {
    "Friendly name": "deathbanish",
    "description": "Whoever strikes the killing blow against this monster is banished to another plane. -11=The Void -12=The Inferno -13=Kokytos"
  },
  {
    "Friendly name": "deathblessbonus",
    "description": "Gods of this nation will get extra bless design points of this type."
  },
  {
    "Friendly name": "deathboost",
    "description": "One commander determined by target requirements or the monster number may gain +1 Death magic."
  },
  {
    "Friendly name": "deathcurse",
    "description": "When this monster dies the unit that strikes the killing blow is cursed."
  },
  {
    "Friendly name": "deathdeath",
    "description": "The effect death and growth has on population death in 0.01% per month. Default is 20."
  },
  {
    "Friendly name": "deathdisease",
    "description": "The monster bursts in a cloud of disease ridden fumes when it dies infecting its killer and anyone nearby with disease."
  },
  {
    "Friendly name": "deathfire",
    "description": "The monster erupts in a fiery explosion when it dies inflicting 10 AP fire damage to everyone in the area of effect."
  },
  {
    "Friendly name": "deathincome",
    "description": "The effect death and growth has on income. Default is 2."
  },
  {
    "Friendly name": "deathparalyze",
    "description": "The monster erupts in a paralyzing explosion on death forcing everyone in the area of effect to make a MR check or become paralyzed."
  },
  {
    "Friendly name": "deathpower",
    "description": "The monster will get stat increases or decreases depending on the Death scale."
  },
  {
    "Friendly name": "deathrange",
    "description": "All Death rituals cast in this province have their range increased by"
  },
  {
    "Friendly name": "deathrec",
    "description": "The monster is cheaper to recruit if there are Death scales in the province. Works identically to #chaosrec. Growth scales do not affect the price."
  },
  {
    "Friendly name": "deathsupply",
    "description": "The effect death and growth has on supplies. Default is 10."
  },
  {
    "Friendly name": "decscale",
    "description": "Decreases the specified scale in the province by one step."
  },
  {
    "Friendly name": "decscale2",
    "description": "Decreases the specified scale in the province by two steps."
  },
  {
    "Friendly name": "decscale3",
    "description": "Decreases the specified scale in the province by three steps."
  },
  {
    "Friendly name": "decunrest",
    "description": "The site decreases unrest in the province. The value can be negative in order to increase unrest."
  },
  {
    "Friendly name": "def",
    "description": "The item grants a defense bonus."
  },
  {
    "Friendly name": "defchaos",
    "description": "Sets the default value of the chaos scale for this nation."
  },
  {
    "Friendly name": "defcom1",
    "description": "Sets the secondary commander for this poptypes PD when PD is 20 or higher."
  },
  {
    "Friendly name": "defcom2",
    "description": "Extra commander for fortified provinces with a province defense equal to or greater than 20."
  },
  {
    "Friendly name": "defdeath",
    "description": "Sets the default value of the death scale for this nation."
  },
  {
    "Friendly name": "defdrain",
    "description": "Sets the default value of the drain scale for this nation."
  },
  {
    "Friendly name": "defector",
    "description": "The monster has a chance to become independent if owned by a player. The Unfettered form of the Eater of the Dead uses this mechanic. This command only affects commanders."
  },
  {
    "Friendly name": "defence",
    "description": " Sets the province defence of the active nation. This command cannot be used for independent provinces."
  },
  {
    "Friendly name": "defmisfortune",
    "description": "Sets the default value of the misfortune scale for this nation."
  },
  {
    "Friendly name": "defmult1",
    "description": "Number of units per 10 points of defense. E.g. __#defmult1 20 will yield 2 units per point of defense which is also the default."
  },
  {
    "Friendly name": "defmult1b",
    "description": "Number of units per 10 points of defense for the second unit type."
  },
  {
    "Friendly name": "defmult1c",
    "description": "Number of units per 10 points of defense for the third unit type."
  },
  {
    "Friendly name": "defmult1d",
    "description": "Number of units per 10 points of defense for the fourth unit type. The default value is 10."
  },
  {
    "Friendly name": "defmult2",
    "description": "Number of bonus units per 10 points of defense equal to or greater than 20."
  },
  {
    "Friendly name": "defmult2b",
    "description": "Number of units per 10 points of defense equal to or greater than 20 for the second bonus unit type. The default value is 10."
  },
  {
    "Friendly name": "defsloth",
    "description": "Sets the default value of the sloth scale for this nation."
  },
  {
    "Friendly name": "defunit1",
    "description": "Sets the first type of unit in the poptype PD."
  },
  {
    "Friendly name": "defunit1b",
    "description": "Sets the second type of unit in the poptype PD."
  },
  {
    "Friendly name": "defunit1c",
    "description": "Sets the third type of unit in the poptype PD."
  },
  {
    "Friendly name": "defunit1d",
    "description": "Fourth type of standard unit for local defense. They appear like defunit1. Usually there is no fourth type and this command isnt used."
  },
  {
    "Friendly name": "defunit2",
    "description": "Bonus units for local defense equal to or greater than 20 in provinces with forts only."
  },
  {
    "Friendly name": "defunit2b",
    "description": "Second type of bonus units for local defense equal to or greater than 20 in provinces with forts."
  },
  {
    "Friendly name": "delay",
    "description": "Succeeding event occurs  turns after this event. The succeeding event will not occur normally."
  },
  {
    "Friendly name": "delay25",
    "description": "Succeeding event occurs  +/- 25% turns after this event. The succeeding event will not occur normally."
  },
  {
    "Friendly name": "delay50",
    "description": "Succeeding event occurs  +/- 50% turns after this event. The succeeding event will not occur normally."
  },
  {
    "Friendly name": "delayskip",
    "description": "Use this command right after a delay command. This is the chance that the next next event will be used instead of the next one, when determining what delayed event to execute. The next next event will not occur normally."
  },
  {
    "Friendly name": "delgod",
    "description": "Deletes a god that is otherwise gained through homerealm use."
  },
  {
    "Friendly name": "demon",
    "description": "This monster is a demon."
  },
  {
    "Friendly name": "demononly",
    "description": "The weapon only causes affects demons."
  },
  {
    "Friendly name": "demononly",
    "description": "The weapon only causes affects demons."
  },
  {
    "Friendly name": "demonundead",
    "description": "The weapon only affects demons and undead."
  },
  {
    "Friendly name": "demonundead",
    "description": "The weapon only affects demons and undead."
  },
  {
    "Friendly name": "descr",
    "description": "A full description of the nation."
  },
  {
    "Friendly name": "description",
    "description": " The description of the map that is shown after selecting a map to play on. Use two newlines to add a new paragraph. Alternatively"
  },
  {
    "Friendly name": "deserter",
    "description": "A commander with this attribute has chance of deserting each month."
  },
  {
    "Friendly name": "details",
    "description": "This command is not necessary. If used it will set the yellow spell detail text under the main spell description."
  },
  {
    "Friendly name": "digest",
    "description": "The monster digests any swallowed creatures. Swallowed creatures take"
  },
  {
    "Friendly name": "disableoldnations",
    "description": "Disables all old nations (up to number 119)"
  },
  {
    "Friendly name": "disease",
    "description": "Every unit in the province has this chance of becoming diseased."
  },
  {
    "Friendly name": "diseasecloud",
    "description": "Monster is surrounded by a disease cloud. Standard size is 6. The disease cloud adds the Plague Carrier icon to the monster."
  },
  {
    "Friendly name": "diseaseres",
    "description": "Protects a unit when diseased. Value is the chance of not being negatively affected by the disease each month."
  },
  {
    "Friendly name": "divineins",
    "description": "There can only be a number of divinely inspired researchers per province equal to the dominion strength in that province. Any extra divinely inspired researchers have their research value ignored. The monks of Man use this mechanic.  These commands cause the monster to produce permanent or temporary magic gems when it is a commander."
  },
  {
    "Friendly name": "djinn",
    "description": "Use this for djinns with a humanoid body but no lower part."
  },
  {
    "Friendly name": "dmg",
    "description": "Sets the damage value of the weapon. A spear has a damage value of 3 and a sword has 6."
  },
  {
    "Friendly name": "doheal",
    "description": "Unit heals normally despite not usually being able to heal."
  },
  {
    "Friendly name": "dom2title",
    "description": " The title of the map. This must be the first command for every map. The reason why this command is named #dom2title instead of #dom5title is because the map command syntax used here was first introduced in Dominions 2: The Ascension Wars and much of it has been kept the same since then."
  },
  {
    "Friendly name": "domdeathsense",
    "description": "Number of unburied corpses will be known where this dominion has influence."
  },
  {
    "Friendly name": "domimmortal",
    "description": "This monster is dominion immortal like a Phoenix."
  },
  {
    "Friendly name": "dominion",
    "description": "The site will spread the gods dominion by automatically initiating a number of temple checks per month."
  },
  {
    "Friendly name": "dominionstr",
    "description": " Sets the dominion strength of a nation to a value between 1 and 10."
  },
  {
    "Friendly name": "domkill",
    "description": "The nations Dominion kills population like Ashen Empire Ermor. Value of 10=1%*Dominion killed every month."
  },
  {
    "Friendly name": "dompower",
    "description": "The monster will get stat increases or decreases depending on the strength of the dominion in the province."
  },
  {
    "Friendly name": "domrec",
    "description": "This monster can only be recruited if the dominion value of the province is at least this high."
  },
  {
    "Friendly name": "domsail",
    "description": "The nations Dominion enables all units to sail like the dark vessels ability of Phaeacia."
  },
  {
    "Friendly name": "domshape",
    "description": "The monster changes to this shape when inside a friendly dominion."
  },
  {
    "Friendly name": "domsummon",
    "description": "Summons a number of monsters each month spent inside friendly dominion. The amount summoned is a dominion strength sided open ended die roll."
  },
  {
    "Friendly name": "domsummon2",
    "description": "Half as effective as #domsummon."
  },
  {
    "Friendly name": "domsummon20",
    "description": "A twentieth as effective as #domsummon."
  },
  {
    "Friendly name": "domunrest",
    "description": "The nations Dominion causes unrest. Unrest increase is equal to value*0.1*dominion per month. Value can be negative for unrest reducing Dominions."
  },
  {
    "Friendly name": "domversion",
    "description": " Set the minimum version of Dominions required to use this map. This number is usually 450 for Dominions 5 maps"
  },
  {
    "Friendly name": "domwar",
    "description": "Dominion conflict bonus."
  },
  {
    "Friendly name": "doomhorror",
    "description": "Monsters with this tag are used as doom horrors."
  },
  {
    "Friendly name": "douse",
    "description": "This monster gets a blood magic bonus when searching for blood slaves. Works like a Sanguine Dousing Rod (this item has a bonus of 1)."
  },
  {
    "Friendly name": "dragonlord",
    "description": "This monster will receive extra units when summoning Drakes of different kind."
  },
  {
    "Friendly name": "drainimmune",
    "description": "The monster is immune to the effects of Drain scale like the Master Smiths of Ulm. There is no research penalty from Drain scale and in combat the fatigue costs of spells are not increased by the Drain scale. The monster gains all normal bonuses from an increased Magic scale."
  },
  {
    "Friendly name": "drake",
    "description": "The monster is a drake and is affected by the Dragon Master ability."
  },
  {
    "Friendly name": "drawsize",
    "description": "The value indicates how many percent larger size the sprite should be drawn at. A negative value means it will be draw at a smaller size than normal."
  },
  {
    "Friendly name": "dt_aff",
    "description": "Sets the damage type of the weapon to a special effect or affliction. The specific affliction the weapon inflicts is set with the #dmg command so the weapons damage value is interpreted as a bitmask value according to the (affliction table)(#afflictions). The table uses bitmask values meaning powers of 2. The numbers are expressed as powers of 2 because numbers after about 2^20 get very big very quickly."
  },
  {
    "Friendly name": "dt_bouncekill",
    "description": "This effect will bounce a few times to nearby targets like a chain lightning. Weapons with this effect should have aoe = 1."
  },
  {
    "Friendly name": "dt_cap",
    "description": "Sets the damage type to capped damage (max 1 HP damage) like a whip or a blowgun."
  },
  {
    "Friendly name": "dt_constructonly",
    "description": "Only inanimate beings are affected by this weapon."
  },
  {
    "Friendly name": "dt_demon",
    "description": "Sets the damage type to anti-demon damage. This means double damage to demons."
  },
  {
    "Friendly name": "dt_drain",
    "description": "The weapon drains life force from its target healing damage and reducing fatigue for the attacker."
  },
  {
    "Friendly name": "dt_holy",
    "description": "Sets the damage type to holy damage. This means triple damage to undead and demons."
  },
  {
    "Friendly name": "dt_interrupt",
    "description": "This damage is not real but it can still interrupt mages casting spells."
  },
  {
    "Friendly name": "dt_large",
    "description": "The weapon does triple damage against creatures larger than the attacker."
  },
  {
    "Friendly name": "dt_magic",
    "description": "The weapon does double damage to magic beings."
  },
  {
    "Friendly name": "dt_normal",
    "description": "Sets the damage type to normal damage. This is the default."
  },
  {
    "Friendly name": "dt_paralyze",
    "description": "Sets the damage type to paralyze. Damage value is NOT directly turns of paralysis. Use 10 for a standard strength paralyze."
  },
  {
    "Friendly name": "dt_poison",
    "description": "Sets the damage delivery mechanism to poison damage. Poison damage is caused over several combat rounds. To make a poisoned weapon do NOT use this command. Use a secondary effect that has both #poison and this command."
  },
  {
    "Friendly name": "dt_raise",
    "description": "If the target is killed by the weapon it is animated as a soulless servant of the attacker."
  },
  {
    "Friendly name": "dt_realstun",
    "description": "Sets the damage type to stun. The damage value for stun weapons should be 100. Stunned units are unable to take any action for about 1 combat round."
  },
  {
    "Friendly name": "dt_sizestun",
    "description": "Sets the damage type to fatigue damage that is less effective on large targets. Effectively the same as #dt_stun + #sizeresist."
  },
  {
    "Friendly name": "dt_small",
    "description": "The weapon does double damage against creatures smaller than the attacker."
  },
  {
    "Friendly name": "dt_stun",
    "description": "Sets the damage type to fatigue damage."
  },
  {
    "Friendly name": "dt_weakness",
    "description": "The weapon drains strength from its target instead of doing normal damage."
  },
  {
    "Friendly name": "dt_weapondrain",
    "description": "The weapon drains life but max 5 points of the damage is used to heal the wielder. Use this for draining weapons that can be wielded or forged."
  },
  {
    "Friendly name": "dungeon",
    "description": "The monster is a suitable encounter in a dungeon."
  },
  {
    "Friendly name": "dyingdom",
    "description": "Dominion is dying and needs blood sacrifice. Temples have no effect here except if blood sacrifices are performed there or if a priest preaches there. Mictlan has a dominion like this combined with #nopreach and #sacrificedom."
  },
  {
    "Friendly name": "earthattuned",
    "description": "Chance of getting a bonus level of magic when transformed into this being.  In place of [path] insert the name of the magic path in all lower case for the correct command (#fireattuned #airattuned etc)."
  },
  {
    "Friendly name": "earthblessbonus",
    "description": "Gods of this nation will get extra bless design points of this type."
  },
  {
    "Friendly name": "earthboost",
    "description": "One commander determined by target requirements or the monster number may gain +1 Earth magic."
  },
  {
    "Friendly name": "earthrange",
    "description": "All Earth rituals cast in this province have their range increased by"
  },
  {
    "Friendly name": "effect",
    "description": "Set the effect of the spell. Some of the most common eff values can be seen in tables Ritual spell effects and Combat spell effects. Value higher than 10000 are rituals and those lower are combat spells. There are many other values that can be used but these are the only documented ones for now. Press ctrl-i in game when viewing the spell details to see some modding information including the effect value."
  },
  {
    "Friendly name": "elegist",
    "description": "The monster is more effective than its normal priest level when calling a god or disciple back from death. The Elegist value is added to its priest level when performing this action."
  },
  {
    "Friendly name": "elementrange",
    "description": "All Elemental magic (Fire Air Water Earth) rituals cast in this province have their range increased by"
  },
  {
    "Friendly name": "emigration",
    "description": "A percentage of the province population emigrates elsewhere."
  },
  {
    "Friendly name": "enc",
    "description": "The basic encumbrance of the monster. Normal humans have 3 and undead beings or machines have 0. Monsters with 0 encumbrance never get exhausted by fighting only spellcasting."
  },
  {
    "Friendly name": "enchcost",
    "description": "All rituals of the Enchantment school cast in this province cost"
  },
  {
    "Friendly name": "enchrebate25p",
    "description": "The monster will be 25 percent cheaper to recruit when this enchantment is active."
  },
  {
    "Friendly name": "enchrebate50",
    "description": "The monster will be 50 gold cheaper to recruit when this enchantment is active."
  },
  {
    "Friendly name": "enchrebate50p",
    "description": "The monster will be 50 percent cheaper to recruit when this enchantment is active."
  },
  {
    "Friendly name": "end",
    "description": "Always use this command at the end of modifying an event."
  },
  {
    "Friendly name": "enemyimmune",
    "description": "Enemy units are immune to this weapon."
  },
  {
    "Friendly name": "entangle",
    "description": "Anyone striking this monster may get entangled."
  },
  {
    "Friendly name": "epithet",
    "description": "Sets the epithet of a nation e.g. Enigma of Steel for Early Era Ulm."
  },
  {
    "Friendly name": "era",
    "description": "Which era should this nation appear in. 1 = early 2 = mid 3 = late or 0 to disable the nation. Two nations with the same name cannot be in the same era. If you change this it must be set right after #name and #epithet."
  },
  {
    "Friendly name": "eramask",
    "description": "The era mask determines which eras the band can appear in. See table Era masks. The default value is All eras."
  },
  {
    "Friendly name": "ethereal",
    "description": "The monster is ethereal. Non-magical weapons have only 25% chance of harming the monster when they hit but when they do they inflict full damage unless mitigated by another ability. Ethereal monsters can pass through walls during the storming of a fortress."
  },
  {
    "Friendly name": "eventisrare",
    "description": "Random events are divided into two categories common and rare. This value is the chance of a random event to be a rare one. Default is 15."
  },
  {
    "Friendly name": "evil",
    "description": "The throne is evil and is likely to be defended by evil monsters."
  },
  {
    "Friendly name": "evocost",
    "description": "All rituals of the Evocation school cast in this province cost"
  },
  {
    "Friendly name": "exactgold",
    "description": "The nation that owns the event gains  gold. Use negative numbers for gold loss.  Scale effects alter the scales of a province. Each #incscale command functions as the equivalent #decscale of its opposite."
  },
  {
    "Friendly name": "expertleader",
    "description": "Leadership value 120. Commander cost +100. Commanded units have a morale modifier of +2 for up to 4 squads and -1 for every additional squad."
  },
  {
    "Friendly name": "expertmagicleader",
    "description": "This monster has an innate ability to command 120 magic beings. This is a very rare ability that only most magic beings possess."
  },
  {
    "Friendly name": "expertundeadleader",
    "description": "This monster has an innate ability to command 120 undead beings. This is a rare ability that usually only demons or undead beings possess."
  },
  {
    "Friendly name": "explspr",
    "description": "Set the particle effect to be used when this spell explodes. -1 = no explosion. See table Explosion fx to find a suitable explosion."
  },
  {
    "Friendly name": "extralife",
    "description": "The bearer of the item is resurrected once when killed in combat. The item disappears when the bearer is resurrected."
  },
  {
    "Friendly name": "eyeloss",
    "description": "Anyone striking this monster may lose an eye."
  },
  {
    "Friendly name": "eyes",
    "description": "Sets the number of eyes for a monster. Number of eyes must be at least one unless the monster is #blind. The number of eyes affects how easily a monster goes blind by battle afflictions."
  },
  {
    "Friendly name": "fallpower",
    "description": "The monster has increased hit points in autumn and lowered hit points in spring."
  },
  {
    "Friendly name": "falsearmy",
    "description": "The monster creates the false impression of greater numbers than there really are. Enemy scouting reports will inflate the size of the army by"
  },
  {
    "Friendly name": "farsail",
    "description": "Commander will be able to sail further if it can sail."
  },
  {
    "Friendly name": "farsumcom",
    "description": "Sets the commander for farsummoned units to something other than the normal units."
  },
  {
    "Friendly name": "farthronekill",
    "description": "This monster will automatically destroy thrones in the same province even if they are protected by a fort. Part is the percentage part that will be destroyed each turn 100 means it will be destroyed in a single turn."
  },
  {
    "Friendly name": "fastcast",
    "description": "Affects the spell casting time for commanders. Speedup 100=half time 200=one third time -50=double time."
  },
  {
    "Friendly name": "fatiguecost",
    "description": "Set the fatigue cost for this spell. Every 100 in fatigue cost raises the required number of gems or blood slaves by one. Must be used also for rituals to set their gem cost."
  },
  {
    "Friendly name": "fear",
    "description": "This monster is very fearsome. A high value indicates higher fear. The standard value is 5. Death magic increases the fear value. The monster lowers the morale of enemy units in"
  },
  {
    "Friendly name": "feature",
    "description": " Puts a specific magic site in the active province. This command can be used a maximum of eight times per province"
  },
  {
    "Friendly name": "features",
    "description": " Sets the magic site frequency. This command will override the site frequency specified in the game setup screen."
  },
  {
    "Friendly name": "feeblemind",
    "description": "The item bearer becomes Feebleminded. The affliction cannot be healed until the item is removed."
  },
  {
    "Friendly name": "female",
    "description": "Being female is a minor advantage that makes you immune to being charmed by the Succubus. Commanders with this tag get feminine names."
  },
  {
    "Friendly name": "fire",
    "description": "This weapon does fire damage. A fire resistant being will take reduced damage from this weapon."
  },
  {
    "Friendly name": "fireattuned",
    "description": "Chance of getting a bonus level of magic when transformed into this being.  In place of [path] insert the name of the magic path in all lower case for the correct command (#fireattuned #airattuned etc)."
  },
  {
    "Friendly name": "fireblessbonus",
    "description": "Gods of this nation will get extra bless design points of this type."
  },
  {
    "Friendly name": "fireboost",
    "description": "One commander determined by target requirements or the monster number may gain +1 Fire magic."
  },
  {
    "Friendly name": "firepower",
    "description": "The monster will get stat increases or decreases depending on the Heat scale."
  },
  {
    "Friendly name": "firerange",
    "description": "All Fire rituals cast in this province have their range increased by"
  },
  {
    "Friendly name": "fireres",
    "description": "The item grants a Fire Resistance bonus."
  },
  {
    "Friendly name": "fireshield",
    "description": "Anyone striking this monster will take"
  },
  {
    "Friendly name": "firstshape",
    "description": "This monster will change shape to its first shape when it feels ok. Werewolves have this ability in their wolf shapes. Monster nbr can be negative for montags."
  },
  {
    "Friendly name": "fixedname",
    "description": "Gives a fixed name to a monster if it is a commander. Useful for giving specific names to heroes."
  },
  {
    "Friendly name": "fixedresearch",
    "description": "The monster produces this amount of research even without magic skills."
  },
  {
    "Friendly name": "fixforgebonus",
    "description": "Gem reduction when forging items. The value is in absolute numbers of gems not in percent like the other forgebonus. This is the default forgebonus mechanic in Dominions 5."
  },
  {
    "Friendly name": "flag",
    "description": "Replace the flag with an image. The image must be 128 pixels wide and 128 pixels high. The flag should be positioned at the bottom of this image and should usually be smaller than the entire image. A standard flag only covers about 75 percent of the height."
  },
  {
    "Friendly name": "flagland",
    "description": "Sets or removes an event flag from a province. The event flag is displayed as an image of a book on the map.  1 = set flag 0 = remove flag Requires an event code in the province. If the event code is reset to 0, the flag automatically disappears."
  },
  {
    "Friendly name": "flail",
    "description": "The weapon has a +2 attack bonus against shields. Morningstars and flails have this feature. Whips do not because they do not have enough momentum when they wrap around a shield."
  },
  {
    "Friendly name": "flightspr",
    "description": "Set the sprite or particle effect to be used when this spell is flying. The flysprite nbr should be a value from the table Flysprites."
  },
  {
    "Friendly name": "float",
    "description": "The item grants its bearer the ability to float."
  },
  {
    "Friendly name": "fly",
    "description": "The item grants its bearer the ability to fly."
  },
  {
    "Friendly name": "flying",
    "description": "This monster can fly. To be able to fly in a storm the monster must also be #stormimmune. The monster can cross rivers. It can also cross mountain passes if it is not cold in the provinces the pass connects."
  },
  {
    "Friendly name": "flyingimmune",
    "description": "Flying and floating beings are immune to this weapon."
  },
  {
    "Friendly name": "flyspr",
    "description": "Use this command to set how the arrow looks like for a missile weapon. A value of -1 for a flysprite means there is no flysprite at all. Table Flysprites shows some numbers that can be used for missile weapons. Flysprite numbers of 10000 and higher are particle effects, lower numbers are hand drawn sprites."
  },
  {
    "Friendly name": "fogcol",
    "description": " Color the world with the specified colors for fights in the current province. Color values range from 0 to 255."
  },
  {
    "Friendly name": "foolscouts",
    "description": "The monster creates the false impression of uniformity in its own army. Enemy scouting reports will perceive the army to only contain one type of troop. The reported troop type is usually the most common troop type present."
  },
  {
    "Friendly name": "foolscouts",
    "description": "The monster creates the false impression of uniformity in its own army. Enemy scouting reports will perceive the army to only contain one type of troop. The reported troop type is usually the most common troop type present."
  },
  {
    "Friendly name": "foreignshape",
    "description": "The monster changes to this shape when moving out of its home province."
  },
  {
    "Friendly name": "forestcom",
    "description": "This commander can be recruited in forest provinces with or without fort. See the box below for all command names."
  },
  {
    "Friendly name": "forestlabcost",
    "description": "Gold cost for building a lab in a forest. Default is 500."
  },
  {
    "Friendly name": "forestrec",
    "description": "This unit can be recruited in forest provinces with or without fort. See the box below for all command names."
  },
  {
    "Friendly name": "forestshape",
    "description": "The monster changes to this shape when moving from a non-forest province to a forest province."
  },
  {
    "Friendly name": "forestsurvival",
    "description": "Monster has the Forest Survival skill. Forest terrain does not hinder movement."
  },
  {
    "Friendly name": "foresttemplecost",
    "description": "Gold cost for building a temple in a forest. Default is 400."
  },
  {
    "Friendly name": "forgebonus",
    "description": "Makes it cheaper to create magic items."
  },
  {
    "Friendly name": "formationfighter",
    "description": "A formation fighter is well drilled in using tight formations and can fit more units into one square. The xsize value indicates the extra size points that will fit in a square. Use a value of 2 for a normal formation fighting human."
  },
  {
    "Friendly name": "fort",
    "description": " Puts a specific fort in the active province. Fort nbr is a number between 1 and 29 and the list of fort numbers can be found in the Fortifications table. Will replace a nations default fort if used on a capital location."
  },
  {
    "Friendly name": "fortcost",
    "description": "Extra cost is the additional amount of gold the nation must pay for its forts expressed as a percentage of the normal cost for building a fort. The default value is 0."
  },
  {
    "Friendly name": "fortera",
    "description": "Determines what kind of forts the nation can build.  0 = palisades only 1 = standard forts for early era 2 = standard forts for middle era 3 = standard forts for late era 4 = better than standard forts for late era"
  },
  {
    "Friendly name": "fortkill",
    "description": "This monster will automatically destroy forts in the same province. Chance is the chance in percent that the fort will be destroyed each turn."
  },
  {
    "Friendly name": "fortunrest",
    "description": "Unrest will increase by 1-value (open ended die roll) in all forts each month.  These commands are set the special attributes of the nation and its Dominion."
  },
  {
    "Friendly name": "friendlyench",
    "description": "1 means the enchantment created by this spell is friendly. It will be dispelled automatically if the province is conquered by the enemy."
  },
  {
    "Friendly name": "friendlyimmune",
    "description": "Friendly units are immune to this weapon."
  },
  {
    "Friendly name": "fullstr",
    "description": "The full weapon wielders strength will be added to the damage. This is the default and need not be specified."
  },
  {
    "Friendly name": "futuresite",
    "description": "This will cause any linked units and commanders to show up on a nations overview screen. Very useful to show summons or other national units upfront."
  },
  {
    "Friendly name": "gainaff",
    "description": "One commander determined by target requirements gains the specified affliction. Afflictions are listed in the table below. The bitmask is expressed as powers of 2. Add together several bitmasks if more than one affliction is desired."
  },
  {
    "Friendly name": "gainmark",
    "description": "One commander determined by target requirements gains one level of horrormark."
  },
  {
    "Friendly name": "gcost",
    "description": "The cost in gold. Most human troops have a gold cost of 10."
  },
  {
    "Friendly name": "gemloss",
    "description": "Lose 3d6 gems of specified type. Gem type 53 can be used for all types, then 1d6 will be lost of each type of gem. Use gem type 56 to exclude blood slaves."
  },
  {
    "Friendly name": "gemprod",
    "description": "This monster produces a number of magic gems each month. The type ranges from 0 (fire gems) to 7 (blood slaves). See table Magic path numbers."
  },
  {
    "Friendly name": "gems",
    "description": "Gives gem income to the magic site. First value is the Path and should be a number between 0 and 7. The second is the amount up to 99. See table magic paths numbers."
  },
  {
    "Friendly name": "ghostreanim",
    "description": "Reanimating priest of this nation will create ghosts like Lemuria.  NOTE, Caelian Atlantian Jotun Rephaite and monkey undead are hard coded for their respective nations and their reanimation cannot be unlocked for modding using reanimation commands.  National Reanimation Lists Use the various monster summoning commands such as #makemonsters15 with a #montag value to create custom reanimation lists for those priests that need it.  18 Poptype Modding Use these commands to mod poptypes."
  },
  {
    "Friendly name": "giftofwater",
    "description": "A commander with this ability is able to bring a number of units underwater with him as long as their combined size points do not exceed the value of this ability."
  },
  {
    "Friendly name": "goddomchaos",
    "description": "Increases the Turmoil or chaos scale of the gods dominion. Use a negative value to increase Order."
  },
  {
    "Friendly name": "goddomcold",
    "description": "Increases the Cold scale of the gods dominion. Use a negative value to increase Heat."
  },
  {
    "Friendly name": "goddomdeath",
    "description": "Increases the Death scale of the gods dominion. Use a negative value to increase Growth."
  },
  {
    "Friendly name": "goddomdrain",
    "description": "Increases the Drain scale of the gods dominion. Use a negative value to increase Magic."
  },
  {
    "Friendly name": "goddomlazy",
    "description": "Increases the Sloth scale of the gods dominion. Use a negative value to increase Production."
  },
  {
    "Friendly name": "goddommisfortune",
    "description": "Increases the Misfortune scale of the gods dominion. Use negative value to increase Luck."
  },
  {
    "Friendly name": "godpathspell",
    "description": "This is used for divine spells that should only be available when the God is best with this particular magic path. -1 can be used for the fallback spell that should be available when the god has no path that is good enough."
  },
  {
    "Friendly name": "godrebirth",
    "description": "The nations god does not lose any magic path levels when recalled from the dead by priests."
  },
  {
    "Friendly name": "gold",
    "description": "The nation that owns the event gains  gold. Use negative numbers for gold loss. The value varies with +/- 50%."
  },
  {
    "Friendly name": "golemhp",
    "description": "Inanimate beings in gain a percentage boost to their hit points for each dominion candle (Golem Cult dominion like Agartha)."
  },
  {
    "Friendly name": "goodleader",
    "description": "Leadership value 80. Commander cost +60. Commanded units have a morale modifier of +1 for up to 3 squads and -1 for every additional squad."
  },
  {
    "Friendly name": "goodmagicleader",
    "description": "This monster has an innate ability to command 80 magic beings. This is a very rare ability that only most magic beings possess."
  },
  {
    "Friendly name": "goodundeadleader",
    "description": "This monster has an innate ability to command 80 undead beings. This is a rare ability that usually only demons or undead beings possess."
  },
  {
    "Friendly name": "greaterhorror",
    "description": "Monsters with this tag are used as horrors."
  },
  {
    "Friendly name": "greekreanim",
    "description": "Reanimating priest of this nation will create greek ghosts like Therodos."
  },
  {
    "Friendly name": "groundcol",
    "description": " Color the world with the specified colors for fights in the current province. Color values range from 0 to 255."
  },
  {
    "Friendly name": "growhp",
    "description": "The monster grows into the previous monster once it has this many hit points or more. Hydras use this mechanic."
  },
  {
    "Friendly name": "guardspirit",
    "description": "Priests of this nation have a chance of receiving a guardian angel when in battle. Nbr can be negative for montags."
  },
  {
    "Friendly name": "guardspiritbonus",
    "description": "Increases the chance of receiving a guardian spirit with +value percent."
  },
  {
    "Friendly name": "halfdeathinc",
    "description": "The nation will only be half as affected by the death/growth scale regarding gold income. Abysia has this ability."
  },
  {
    "Friendly name": "halfdeathpop",
    "description": "The nation will only be half as affected by the death/growth scale regarding population growth. Abysia has this ability."
  },
  {
    "Friendly name": "halfstr",
    "description": "Only one half of the weapon wielders strength will be added to the damage. This is normally used for the breath weapons of dragons."
  },
  {
    "Friendly name": "haltheretic",
    "description": "Works like Awe, except that it only works against sacred units."
  },
  {
    "Friendly name": "hardmrneg",
    "description": "The effects of the weapon may be resisted by MR but there is a penalty to the MR check."
  },
  {
    "Friendly name": "hatesterr",
    "description": "Makes the nation less likely to start in one of the terrains in the terrain mask."
  },
  {
    "Friendly name": "heal",
    "description": "The site causes a healing check to be performed at the indicated percent chance on every unit in the province like a healing unit set to Heal Troops. If the healing check is successful a check against the healing difficulty of any affliction the unit has is performed. If the difficulty check is successful up to one affliction is removed."
  },
  {
    "Friendly name": "healer",
    "description": "Grants a commander the Heal Troops ability. The percent value is the chance of success for every unit in the province. Success chance is checked against every unit to see if the commander successfully uses the healing ability. If successful a check is made against the difficulty of each affliction and if it succeeds the affliction in question is healed. Some afflictions are harder to heal than others. This command still works but it is replaced in all instances of in-game occurrence with the #autohealer or #autodishealer mechanic."
  },
  {
    "Friendly name": "heat",
    "description": "This monster is surrounded by heat like an Abysian. The heat aura is"
  },
  {
    "Friendly name": "heatrec",
    "description": "Heat scale requirement for recruitment."
  },
  {
    "Friendly name": "heretic",
    "description": "The monster decreases dominion in the province it resides in as if it was an enemy priest engaged in preaching. The value of the heretic ability acts as the priest level and should be set within the range of 1 \\u2013 5."
  },
  {
    "Friendly name": "hero1",
    "description": "Gives a hero to the modded nation. A nation can have up to ten different heroes. Use monster nbr -1 to remove a hero."
  },
  {
    "Friendly name": "hero10",
    "description": "Gives a hero to the modded nation. A nation can have up to ten different heroes. Use monster nbr -1 to remove a hero."
  },
  {
    "Friendly name": "hero2",
    "description": "Gives a hero to the modded nation. A nation can have up to ten different heroes. Use monster nbr -1 to remove a hero."
  },
  {
    "Friendly name": "hero3",
    "description": "Gives a hero to the modded nation. A nation can have up to ten different heroes. Use monster nbr -1 to remove a hero."
  },
  {
    "Friendly name": "hero4",
    "description": "Gives a hero to the modded nation. A nation can have up to ten different heroes. Use monster nbr -1 to remove a hero."
  },
  {
    "Friendly name": "hero5",
    "description": "Gives a hero to the modded nation. A nation can have up to ten different heroes. Use monster nbr -1 to remove a hero."
  },
  {
    "Friendly name": "hero6",
    "description": "Gives a hero to the modded nation. A nation can have up to ten different heroes. Use monster nbr -1 to remove a hero."
  },
  {
    "Friendly name": "hero7",
    "description": "Gives a hero to the modded nation. A nation can have up to ten different heroes. Use monster nbr -1 to remove a hero."
  },
  {
    "Friendly name": "hero8",
    "description": "Gives a hero to the modded nation. A nation can have up to ten different heroes. Use monster nbr -1 to remove a hero."
  },
  {
    "Friendly name": "hero9",
    "description": "Gives a hero to the modded nation. A nation can have up to ten different heroes. Use monster nbr -1 to remove a hero."
  },
  {
    "Friendly name": "hiddenench",
    "description": "1 means the enchantment created by this spell is not visible during battles. It should be used on enchantments that does not affect battles."
  },
  {
    "Friendly name": "hiddensite",
    "description": "Adds a new, hidden site to the province. Use -1 for site number to place [sitename] instead. [sitename] must be added to event message text in brackets."
  },
  {
    "Friendly name": "holy",
    "description": "Holy (sacred) troops can be blessed by priests."
  },
  {
    "Friendly name": "holyboost",
    "description": "One commander determined by target requirements or the monster number may gain +1 Priest level."
  },
  {
    "Friendly name": "holyfire",
    "description": "Every turn any undead or demonic troops in the province have the indicated chance (percent) to be struck by holy fire which deals 10 points of armor-negating damage if they fail a MR check against an attack value of 12."
  },
  {
    "Friendly name": "holypower",
    "description": "Every turn any undead troops in the province have the indicated chance (percent) to be struck by holy power which deals 10 points of armor- negating damage if they fail a MR check against an attack value of 12."
  },
  {
    "Friendly name": "homecom",
    "description": "Adds a monster that can be recruited as commander by the original owner of this site only."
  },
  {
    "Friendly name": "homefort",
    "description": "The nation will start with this fort in its home province. This command does not affect what type of forts the nation can build. The command is only necessary if the home fort should deviate from the standard one for their fortera. See the table below for a list of forts."
  },
  {
    "Friendly name": "homemon",
    "description": "Adds a monster that can be recruited by the original owner of this site only."
  },
  {
    "Friendly name": "homerealm",
    "description": "Any gods that belong to this realm (through the use of the #homerealm monster modding command) are automatically included in the nations default list of pretenders and need not be separately added to the list with the #addgod command. See Table Home realms. Unlike the homerealm of a pretender god the homerealm of a nation cannot be cleared."
  },
  {
    "Friendly name": "homeshape",
    "description": "The monster changes to this shape when moving into its home province."
  },
  {
    "Friendly name": "homesick",
    "description": "This monster takes damage equal to the indicated percentage of its total hit points every turn it spends away from its home province (the province where it was first recruited summoned or spawned)."
  },
  {
    "Friendly name": "horrordeserter",
    "description": "Like #deserter but the desertion chance is increased during astral corruption."
  },
  {
    "Friendly name": "horrormark",
    "description": "Every turn any unit in the province has the indicated chance (percent) to be horror marked."
  },
  {
    "Friendly name": "horsereanim",
    "description": "Reanimating priests with holy magic of level 3 or higher can reanimate longdead horsemen. Sceleria and Ashen Empire Ermor have this attribute."
  },
  {
    "Friendly name": "horsetattoo",
    "description": "Magic tattoo like the units of Marverni and Sauromatia have."
  },
  {
    "Friendly name": "hp",
    "description": "The item grants a bonus to hit points."
  },
  {
    "Friendly name": "hpoverflow",
    "description": "The monsters hit points can increase past the normal maximum. The extra HP are permanently retained until lost due to damage. This command is useful for units that possess life drain attacks or that can #digest swallowed monsters."
  },
  {
    "Friendly name": "hpoverslow",
    "description": "The monsters hit points can go over their normal maximum value by 0 - 1000 percent. They will slowly return to normal."
  },
  {
    "Friendly name": "humanoid",
    "description": "The default bodytype. Use this for humans ogres angels humanlike statues and similar."
  },
  {
    "Friendly name": "iceforging",
    "description": "The monster generates"
  },
  {
    "Friendly name": "iceprot",
    "description": "Protection varies with the temperature in the province. The protection value is added or subtracted for every step on the Cold scale."
  },
  {
    "Friendly name": "iceweapon",
    "description": "The weapon is made of ice and cannot be fire blessed."
  },
  {
    "Friendly name": "icon",
    "description": "A banner image for your mod. This image should be 128x32 or 256x64 pixels large."
  },
  {
    "Friendly name": "id",
    "description": "Sets an event identifier. Used for spells that create anonymous random events."
  },
  {
    "Friendly name": "idealcold",
    "description": "Sets the preferred level of cold for the nation. This ranges from -3 (very hot) to 3 (very cold)."
  },
  {
    "Friendly name": "illusion",
    "description": "Gives a monster glamour. These monsters cannot be discovered by scouts and have a mirror image protecting them in battles. This command adds 25 to the monsters existing stealth value if it already has the #stealthy attribute. Glamour does not grant stealth to monsters that have no stealth to begin with."
  },
  {
    "Friendly name": "imagefile",
    "description": " The image file of the map in TGA"
  },
  {
    "Friendly name": "immobile",
    "description": "This monster is Immobile like the Monolith. Immobile units may teleport but cannot use the Cloud Trapeze spell.."
  },
  {
    "Friendly name": "immortal",
    "description": "This monster is immortal like a Lich."
  },
  {
    "Friendly name": "inanimate",
    "description": "Inanimate beings are immune to some spells."
  },
  {
    "Friendly name": "inanimateimmune",
    "description": "Lifeless beings are immune to this weapon."
  },
  {
    "Friendly name": "inccorpses",
    "description": "Number of unburied corpses increases by this amount +/- 25%. The value can be negative to remove corpses."
  },
  {
    "Friendly name": "incdom",
    "description": "Increases dominion in the province by  candles."
  },
  {
    "Friendly name": "incorporate",
    "description": "The monster incorporates any swallowed creatures as a part of itself. Swallowed creatures take damage every combat round until dead or until the monster that swallowed them is killed.  The monster that incorporates them heals a number of hit points equal to damage inflicted every combat round."
  },
  {
    "Friendly name": "incpop",
    "description": "Province population increases by this amount +/- 25%."
  },
  {
    "Friendly name": "incprovdef",
    "description": "The monster is good at organizing province defenses. PD is increased by"
  },
  {
    "Friendly name": "incscale",
    "description": "Increases the specified scale in the province by one step."
  },
  {
    "Friendly name": "incscale2",
    "description": "Increases the specified scale in the province by two steps."
  },
  {
    "Friendly name": "incscale3",
    "description": "Increases the specified scale in the province by three steps."
  },
  {
    "Friendly name": "incunrest",
    "description": "The monster will increase or decrease unrest at his location. The value divided by 10 is the amount increased per month. A negative can be used to decrease unrest instead."
  },
  {
    "Friendly name": "indepflag",
    "description": "Replace the flag of independents with an image. The image must be 128 pixels wide and 128 pixels high. The flag should be positioned at the bottom of this image. This command is special in that it should be used when no nation is selected i.e. before #selectnation or #newnation."
  },
  {
    "Friendly name": "indepmove",
    "description": "This ability is used by certain horrors to make them move on the world map. A monster with this ability have percent chance of moving each month as long as it is owned by independents."
  },
  {
    "Friendly name": "indepspells",
    "description": "Usually independent mages will only know low level research spells. This command will give them access to all spell with this research level and lower when they fight as independent."
  },
  {
    "Friendly name": "indepstay",
    "description": "A 1 in this ability means that the monster will stop moving once it has reached a throne province."
  },
  {
    "Friendly name": "infernoret",
    "description": "Extra chance per month of returning from the Inferno the infernal realm of fire."
  },
  {
    "Friendly name": "inquisitor",
    "description": "This monster has a bonus when preaching against enemy Dominion. Its holy magic level counts as double for this purpose. The monster must have the #holy tag."
  },
  {
    "Friendly name": "insane",
    "description": "The monster has a chance of being insane each turn. The Mad Priests of Rlyeh have a value of 50 in this attribute."
  },
  {
    "Friendly name": "insanify",
    "description": "The monster spreads insanity to both military units and population in the province. The percent value is the chance for a military unit in the same province to be infected."
  },
  {
    "Friendly name": "inspirational",
    "description": "All units under the command of this monster have their morale increased by"
  },
  {
    "Friendly name": "inspiringres",
    "description": "The monster inspires other mages to be more effective researchers. All other mages in the same province gain a research bonus equal to"
  },
  {
    "Friendly name": "internal",
    "description": "The weapon inflicts internal damage that cannot be negated by effects like mist form mossbody etc. Used on e.g. Incinerate and Disintegrate."
  },
  {
    "Friendly name": "invisible",
    "description": "Invisible units can only be seen by units with spirit sight. When a unit with invisibility is sneaking only patrolling units with spirit sight will be able to find it. In combat invisibility gives any melee attackers -10 to their attack skill unless they have spirit sight."
  },
  {
    "Friendly name": "invulnerable",
    "description": "The monster has invulnerability to non-magical weapons. The invulnerability value counts as natural protection against normal weapons."
  },
  {
    "Friendly name": "ironarmor",
    "description": "Indicates that the armor is made of iron."
  },
  {
    "Friendly name": "ironskin",
    "description": "The item automatically applies the Ironskin spell to the bearer."
  },
  {
    "Friendly name": "ironvul",
    "description": "The monster will take points amount of extra damage when wounded by an iron weapon in melee."
  },
  {
    "Friendly name": "ironweapon",
    "description": "The weapon is made of iron and is subject to rust and spells that damage iron equipment."
  },
  {
    "Friendly name": "islance",
    "description": "This item can only be used by mounted or flying units or centaurs."
  },
  {
    "Friendly name": "islandnation",
    "description": "The nation prefers to start on an island if possible or a coast if no suitable island could be found."
  },
  {
    "Friendly name": "islandsite",
    "description": "Like #startsite but the nation will only get the site if it starts on an island."
  },
  {
    "Friendly name": "item",
    "description": "A specific magic item for the commander. A maximum four items per band can be assigned."
  },
  {
    "Friendly name": "itemcost1",
    "description": "This command makes the item bonus percent more expensive to forge. Negative values can also be used to make it cheaper. The itemcost1 command only affects the cost of the first magic path."
  },
  {
    "Friendly name": "itemcost2",
    "description": "This command makes the item bonus percent more expensive to forge. Negative values can also be used to make it cheaper. The itemcost2 command only affects the cost of the second magic path."
  },
  {
    "Friendly name": "itemdrawsize",
    "description": "The value indicates how many percent larger size the item sprite should be drawn at. A negative value means it will be draw at a smaller size than normal."
  },
  {
    "Friendly name": "itemslots",
    "description": "Sets which item slots are available for this monster. See Table Item slot values for useful slot values. If you want to have 2 hand slots and 1 body slot then just add those two numbers together. Never add 1 hand and 1 hand use the 2 hands value instead. The bottom three entries in the table are some precalculated values for your convenience."
  },
  {
    "Friendly name": "ivylord",
    "description": "This monster will receive extra units when summoning Vine Men of different kind."
  },
  {
    "Friendly name": "kill",
    "description": "Kills off a percentage of the province population."
  },
  {
    "Friendly name": "kill2d6mon",
    "description": "Kills 2d6 non-commander units of the specified type in the province."
  },
  {
    "Friendly name": "killcappop",
    "description": "Kills a percentage of the capitals population when the game starts. Value can be negative to increase population instead.  These mod commands are instructions to the Dominions 5 artificial intelligence on certain aspects of managing the nation. They have no effect in a game where the nation is controlled by a human player."
  },
  {
    "Friendly name": "killcom",
    "description": "Kills a commander of the specified type in the province."
  },
  {
    "Friendly name": "killfeatures",
    "description": " Removes all magic sites from the active province."
  },
  {
    "Friendly name": "killmon",
    "description": "Kills one non-commander unit of the specified type in the province."
  },
  {
    "Friendly name": "killpop",
    "description": "Kills off a fixed number of province population. One dekapop equals 10 inhabitants. The exact amount varies with +/- 25%."
  },
  {
    "Friendly name": "knownfeature",
    "description": " Puts a specific magic site in the active province. This site is already found at the start of the game"
  },
  {
    "Friendly name": "kokytosret",
    "description": "Extra chance per month of returning from Kokytos the infernal realm of ice."
  },
  {
    "Friendly name": "lab",
    "description": " Puts a laboratory in the active province."
  },
  {
    "Friendly name": "labcost",
    "description": "Gold cost for building a lab. The default is 500."
  },
  {
    "Friendly name": "lamialord",
    "description": "This monster will receive extra units when summoning Lamias of different kind. This ability will not be visible when inspecting the monster."
  },
  {
    "Friendly name": "lanceok",
    "description": "This monster can use lances even though it is not flying or mounted. Use this attribute on centaurs."
  },
  {
    "Friendly name": "land",
    "description": " Sets the active province and kills everyone in it. All the following commands will only affect the active province. Use this command if you want to activate a province in order to replace its random inhabitants with the monsters of your choice."
  },
  {
    "Friendly name": "landcom",
    "description": "Add a unit to the list of recruitable commanders for this nation in overwater forts. Only use this command for underwater nations."
  },
  {
    "Friendly name": "landdamage",
    "description": "The monster will take damage equal to the indicated percentage of its total hit points every turn it spends in a land province instead of underwater."
  },
  {
    "Friendly name": "landgold",
    "description": "Permanent increase to province gold income. Can be negative to reduce income."
  },
  {
    "Friendly name": "landname",
    "description": " Sets the name of a specific province.  6.4 Terrain Type in the Map File"
  },
  {
    "Friendly name": "landprod",
    "description": "Permanent increase to province resources. Can be negative to cause reduce resources."
  },
  {
    "Friendly name": "landrec",
    "description": "Add a unit to the list of recruitable units for this nation in overwater forts. Only use this command for underwater nations."
  },
  {
    "Friendly name": "landshape",
    "description": "The monster changes to this shape when moving from a water province to a land province."
  },
  {
    "Friendly name": "latehero",
    "description": "Use this command on a hero unit to prevent it from appearing before this turn."
  },
  {
    "Friendly name": "len",
    "description": "Sets the length of the weapon. This should be a value between 0 (fist) and 5 (pike). A spear has a value of 3 and a sword 1."
  },
  {
    "Friendly name": "leper",
    "description": "The monster spreads a very deadly disease that kills population and infects military units in the province. The percent value is the chance for a military unit in the same province to be infected."
  },
  {
    "Friendly name": "lesserhorror",
    "description": "Monsters with this tag are used as lesser horrors."
  },
  {
    "Friendly name": "level",
    "description": "Level should be a number between 0 and 4 and is the level of magic required to find the site. Level 0 sites are automatically discovered."
  },
  {
    "Friendly name": "likespop",
    "description": "The nation gets cheaper PD from this poptype. Can be used multiple times for different poptypes."
  },
  {
    "Friendly name": "likesterr",
    "description": "Makes the nation more likely to start in one of the terrains in the terrain mask."
  },
  {
    "Friendly name": "limitedregen",
    "description": "Like regeneration but doesnt work on inanimate beings."
  },
  {
    "Friendly name": "linger",
    "description": "Use this command for global events whose effects last for more than one turn."
  },
  {
    "Friendly name": "lizard",
    "description": "Four legged beast but lower. Use this for dragons."
  },
  {
    "Friendly name": "loc",
    "description": "This command can restrict the random placement of a site to certain terrains or flag the site as unique."
  },
  {
    "Friendly name": "loseeye",
    "description": "The item bearer loses an eye. The affliction cannot be healed until the item is removed."
  },
  {
    "Friendly name": "luck",
    "description": "The item grants Luck to its bearer like Faithful."
  },
  {
    "Friendly name": "luckevents",
    "description": "How luck affects event frequency. Default is 5."
  },
  {
    "Friendly name": "mag_air",
    "description": " Gives active commander Air magic."
  },
  {
    "Friendly name": "mag_astral",
    "description": " Gives active commander Astral magic."
  },
  {
    "Friendly name": "mag_blood",
    "description": " Gives active commander Blood magic."
  },
  {
    "Friendly name": "mag_death",
    "description": " Gives active commander Death magic."
  },
  {
    "Friendly name": "mag_earth",
    "description": " Gives active commander Earth magic."
  },
  {
    "Friendly name": "mag_fire",
    "description": " Gives active commander Fire magic."
  },
  {
    "Friendly name": "mag_nature",
    "description": " Gives active commander Nature magic."
  },
  {
    "Friendly name": "mag_priest",
    "description": " Gives active commander Holy magic."
  },
  {
    "Friendly name": "mag_water",
    "description": " Gives active commander Water magic."
  },
  {
    "Friendly name": "magic",
    "description": "This is a magic weapon that can harm ethereal units with ease."
  },
  {
    "Friendly name": "magicarmor",
    "description": "Indicates that the armor is magic. Magic armors are more resistant to being destroyed by magic effects."
  },
  {
    "Friendly name": "magicbeing",
    "description": "This monster is a magic being."
  },
  {
    "Friendly name": "magicboost",
    "description": "The item increases the bearers magic skill. Path is 0-8 or 51=elements 52=sorcery 53=all."
  },
  {
    "Friendly name": "magiccommand",
    "description": "Increases magic leadership by this amount."
  },
  {
    "Friendly name": "magicimmune",
    "description": "The monster is immune to the research effects of Drain and Magic scales. There is no research penalty for Drain scale and no research bonus for magic scale."
  },
  {
    "Friendly name": "magicitem",
    "description": "The nation that owns the event gains a magic item that is placed directly into the lab. Item rarity is listed in the table below. When rarity 9 is used, add the [itemname] in brackets at the end of the event message text defined by the #msg command."
  },
  {
    "Friendly name": "magicpower",
    "description": "The monster will get stat increases or decreases depending on the Magic scale."
  },
  {
    "Friendly name": "magicskill",
    "description": "Gives a magic skill to the active monster. The path must be a number from the Magic path numbers table and level should be a number from 1 to 10. If the monster already has this magic skill then the old level will be replaced by the new one unless it is a random skill. Units with Holy magic must also have the #holy command."
  },
  {
    "Friendly name": "magicstudy",
    "description": "Research bonus depending on the magic scale of the province."
  },
  {
    "Friendly name": "mainlevel",
    "description": "Main path level requirement to forge this magic item. The level can be anything from 1 to 8. The cost of forging the magic item also depends on the level requirements."
  },
  {
    "Friendly name": "mainpath",
    "description": "Main path required to forge this magic item. The path is a number from 0 to 7 (see table Magic path numbers)."
  },
  {
    "Friendly name": "makemonsters1",
    "description": "Gives the monster a special order that can summon a monster per month. #makemonsters2 to #makemonsters5 can also be used to summon more monsters per month."
  },
  {
    "Friendly name": "makemonsters2",
    "description": "Gives the monster a special order that can summon a monster per month. #makemonsters2 to #makemonsters5 can also be used to summon more monsters per month."
  },
  {
    "Friendly name": "makemonsters3",
    "description": "Gives the monster a special order that can summon a monster per month. #makemonsters2 to #makemonsters5 can also be used to summon more monsters per month."
  },
  {
    "Friendly name": "makemonsters4",
    "description": "Gives the monster a special order that can summon a monster per month. #makemonsters2 to #makemonsters5 can also be used to summon more monsters per month."
  },
  {
    "Friendly name": "makemonsters5",
    "description": "Gives the monster a special order that can summon a monster per month. #makemonsters2 to #makemonsters5 can also be used to summon more monsters per month."
  },
  {
    "Friendly name": "makepearls",
    "description": "The monster can turn"
  },
  {
    "Friendly name": "manikinreanim",
    "description": "Reanimating priest of this nation will create carrion beasts like Asphodel."
  },
  {
    "Friendly name": "mapmove",
    "description": "The speed at which the monster travels on the world map. The old Dominions 4 values are 1 for heavy infantry 2 for a lightly armed human or knights and 3 for light cavalry. You can use these values and the game will automatically convert them to values suitable for Dominions 5."
  },
  {
    "Friendly name": "mapspeed",
    "description": "Increase the map movement value for the items bearer."
  },
  {
    "Friendly name": "mapteleport",
    "description": "Like #teleport but only grants teleport ability on the map not in combat."
  },
  {
    "Friendly name": "maptextcol",
    "description": " Sets the color used to print province names. Each value should be between 0.0 and 1.0."
  },
  {
    "Friendly name": "mason",
    "description": "A mason is able to lead the construction of more advanced forts than what would otherwise be possible for the nation. A mason will be able to upgrade a fortress one step further than normally possible."
  },
  {
    "Friendly name": "masterrit",
    "description": "Pathboost for the purpose of casting rituals. A monster with this ability can cast rituals that would require"
  },
  {
    "Friendly name": "mastersmith",
    "description": "The monsters magic paths are counted as"
  },
  {
    "Friendly name": "maxage",
    "description": "This maximum age for a monster. After this age it will risk getting afflictions and eventually die. Default is 50 for humans 500 for undead 1000 for demons. Different magic paths increase maxage 50% of this value per point of magic depending on the type of creature. Undead are affected by Death magic inanimate creatures by Earth magic demons by Blood magic and all others by Nature magic in that order (if the monster belongs to more than one of these categories at once e.g. lifeless undead)."
  },
  {
    "Friendly name": "maxbounces",
    "description": "Set the maximum number of bounces for a chain lightning (effect 134) type of spell effect."
  },
  {
    "Friendly name": "maxprison",
    "description": "Gods of this nation must not be imprisoned to more than this level. 0=awake 1=dormant 2=no limit."
  },
  {
    "Friendly name": "maxsize",
    "description": "This item can only by a unit of this size or smaller."
  },
  {
    "Friendly name": "melee50",
    "description": "This melee weapon only has 50% chance of being used."
  },
  {
    "Friendly name": "melee50",
    "description": "This melee weapon only has 50% chance of being used."
  },
  {
    "Friendly name": "merccost",
    "description": "Mercenaries are this much more expensive. Can be negative."
  },
  {
    "Friendly name": "mind",
    "description": "Mindless beings are immune to this weapon."
  },
  {
    "Friendly name": "mindslime",
    "description": "Grants the mindslime ability."
  },
  {
    "Friendly name": "mindvessel",
    "description": "Just read the wiki."
  },
  {
    "Friendly name": "minmen",
    "description": "Once the number of troops fall below this recruitment of new troops will start."
  },
  {
    "Friendly name": "minpay",
    "description": "The minimum amount of gold the band can be hired for."
  },
  {
    "Friendly name": "minprison",
    "description": "Gods of this nation must be imprisoned to at least this level. 0=no limit 1=dormant 2=imprisoned."
  },
  {
    "Friendly name": "minsize",
    "description": "This item can only by a unit of this size or larger."
  },
  {
    "Friendly name": "minsizeleader",
    "description": "A unit with this Attribute can only be lead by a commander whos minimum Size is equal to or greater then the listed value. 0-6"
  },
  {
    "Friendly name": "miscshape",
    "description": "Use this for strange things like cubes or fountains."
  },
  {
    "Friendly name": "misfortune",
    "description": "How (mis)fortune affects the possibility of an event being good. Default is 15."
  },
  {
    "Friendly name": "modname",
    "description": "A short name for the mod. It will be displayed in the mod preferences."
  },
  {
    "Friendly name": "mon",
    "description": "Adds a monster that can be recruited by the owner of this site."
  },
  {
    "Friendly name": "monpresentrec",
    "description": "This monster can only be recruited if a unit of monster name type is present in the recruiting province. Montag numbers can be used."
  },
  {
    "Friendly name": "montag",
    "description": "This command assigns a monster tag value to a creature. The value must be a number between 1000 and 100000. The monster tag value is a summoning marker that can be used with the other monster summoning commands and in spell modding to summon randomly determined monsters from a defined list. When a summoning command or spell is used with the montag value a random creature with that montag value is summoned. Use a minus sign before the value when using it in this manner for the command to work correctly.  Example, Five monsters with a #montag 2500 could be set as random monster summons by assigning #summon2 -2500 to another monster. This would result in two random monsters from those five being summoned.  The monster tag can also be used as damage value for summoning spells which will then summon a random monster from the group with the same tag. To use it that way set spell damage to [minus]."
  },
  {
    "Friendly name": "montagweight",
    "description": "Use this command after a montag command to make it more likely to appear than other monster with the same montag. The weight defaults to 1 which gives this montag the same chance of occurring as other montags with weight 1 (or no specified weight). A weight of 2 will make it twice as likely to appear and so forth. Maximum weight is 100."
  },
  {
    "Friendly name": "mor",
    "description": "The morale of the monster. A normal human soldier has morale 10 a satyr of Pangaea has 8 and a fierce minotaur has 13. Giving a monster 50 in morale makes it mindless and prone to dissolving due to lack of proper leadership. Undead with a mind but nothing to lose usually have 30 in morale."
  },
  {
    "Friendly name": "morale",
    "description": "The item grants a morale bonus."
  },
  {
    "Friendly name": "mountaincom",
    "description": "This commander can be recruited in mountain provinces with or without fort. See the box below for all command names."
  },
  {
    "Friendly name": "mountainrec",
    "description": "This unit can be recruited in mountain provinces with or without fort. See the box below for all command names."
  },
  {
    "Friendly name": "mountainsurvival",
    "description": "Monster has the Mountain Survival skill. Mountain terrain does not hinder movement and the monster can cross mountain passes even if it is cold in the provinces the pass connects."
  },
  {
    "Friendly name": "mounted",
    "description": "Indicates the monster is mounted. Mounted monsters have increased defense (+3) and do not suffer from armor encumbrance but should have about two extra in basic encumbrance."
  },
  {
    "Friendly name": "mountedhumanoid",
    "description": "Regarding hit locations this is the same as humanoid but it removes the boot item slot and is provided for convenience because humanoid cavalry is very common. Use this for cavalry centaurs and similar."
  },
  {
    "Friendly name": "mr",
    "description": "The item grants a magic resistance bonus."
  },
  {
    "Friendly name": "mrnegates",
    "description": "The effects of the weapon can be resisted by MR."
  },
  {
    "Friendly name": "mrnegateseasily",
    "description": "The effects of the weapon can be easily resisted by MR."
  },
  {
    "Friendly name": "msg",
    "description": "Message text for the event. For many event modding commands that need item or site names to be determined for the event to function, the item or site name to be added to the end of the text of this command in brackets."
  },
  {
    "Friendly name": "multihero1",
    "description": "Gives a multihero to the modded nation. Use e.g. #multihero1 to set the first of seven possible multiheroes. A multihero is a hero that never runs out, i.e. there is an infinite supply of that type of hero."
  },
  {
    "Friendly name": "multihero2",
    "description": "Gives a multihero to the modded nation. Use e.g. #multihero1 to set the first of seven possible multiheroes. A multihero is a hero that never runs out, i.e. there is an infinite supply of that type of hero."
  },
  {
    "Friendly name": "multihero3",
    "description": "Gives a multihero to the modded nation. Use e.g. #multihero1 to set the first of seven possible multiheroes. A multihero is a hero that never runs out, i.e. there is an infinite supply of that type of hero."
  },
  {
    "Friendly name": "multihero4",
    "description": "Gives a multihero to the modded nation. Use e.g. #multihero1 to set the first of seven possible multiheroes. A multihero is a hero that never runs out, i.e. there is an infinite supply of that type of hero."
  },
  {
    "Friendly name": "multihero5",
    "description": "Gives a multihero to the modded nation. Use e.g. #multihero1 to set the first of seven possible multiheroes. A multihero is a hero that never runs out, i.e. there is an infinite supply of that type of hero."
  },
  {
    "Friendly name": "multihero6",
    "description": "Gives a multihero to the modded nation. Use e.g. #multihero1 to set the first of seven possible multiheroes. A multihero is a hero that never runs out, i.e. there is an infinite supply of that type of hero."
  },
  {
    "Friendly name": "multihero7",
    "description": "Gives a multihero to the modded nation. Use e.g. #multihero1 to set the first of seven possible multiheroes. A multihero is a hero that never runs out, i.e. there is an infinite supply of that type of hero."
  },
  {
    "Friendly name": "mute",
    "description": "The item bearer becomes Mute. The affliction cannot be healed until the item is removed."
  },
  {
    "Friendly name": "naga",
    "description": "Snake like lower part and a humanoid upper body. Use this for nagas."
  },
  {
    "Friendly name": "name",
    "description": "Sets the name of the nation. Even though the name of a nation is changed the file names for the 2h and trn files will be the same as the old nations. If the name is changed then this must be the first command when modifying the nation."
  },
  {
    "Friendly name": "nametype",
    "description": "Sets the type of random name that this monster gets when its a commander. For name numbers and their meaning see table Name Types. If you do not set the name type explicitly then Dominions will take a guess based on gender size resistances and so forth and sometimes come up with the correct result anyway. Nametypes 161 \\u2013 299 should be used for modding purposes."
  },
  {
    "Friendly name": "nat",
    "description": "Sets the nation for the following two commands."
  },
  {
    "Friendly name": "natcom",
    "description": "Adds a monster that can be recruited as commander if the site is owned by the nation set by the #nat command."
  },
  {
    "Friendly name": "nation",
    "description": "Sets the nation that owns the event. The default owner is independents.  -1 = random enemy -2 = province owner The effects of the event are applied in the province where the event occurs and by the nation who owns the event. In an event with an attack, it can be used to set the attacking troops to be non-independents."
  },
  {
    "Friendly name": "nationench",
    "description": "Sets the event owner to the nation that has this global enchantment active. This command is useful to create global enchantments that spawns units owned by the caster of the global enchantment."
  },
  {
    "Friendly name": "nationinc",
    "description": "The nation will receive this much extra gold each month. The percentage value can be negative to make a nation that earn less gold."
  },
  {
    "Friendly name": "nationrebate",
    "description": "The item is 20% cheaper to forge for this nation. Can be used multiple times on one item to enable it for a few nations. A nation nbr of -1 uses the last manipulated nation so this command can be used with #newnation."
  },
  {
    "Friendly name": "natmon",
    "description": "Adds a monster that can be recruited if the site is owned by the nation set by the #nat command."
  },
  {
    "Friendly name": "natural",
    "description": "Marks the weapon as a natural ranged weapon. Use this for things like breath weapons or mind blasts. Weapons with this attribute will not be affected by blesses like fire weapons."
  },
  {
    "Friendly name": "natureattuned",
    "description": "Chance of getting a bonus level of magic when transformed into this being.  In place of [path] insert the name of the magic path in all lower case for the correct command (#fireattuned #airattuned etc)."
  },
  {
    "Friendly name": "natureblessbonus",
    "description": "Gods of this nation will get extra bless design points of this type."
  },
  {
    "Friendly name": "natureboost",
    "description": "One commander determined by target requirements or the monster number may gain +1 Nature magic."
  },
  {
    "Friendly name": "naturerange",
    "description": "All Nature rituals cast in this province have their range increased by"
  },
  {
    "Friendly name": "neednoteat",
    "description": "This monster doesnt need any food and doesnt consume any supplies. To create a monster that cannot starve but still eats combine this effect with a negative #supplybonus."
  },
  {
    "Friendly name": "neighbour",
    "description": " Makes it possible to move between these two provinces (in both directions). Use the map editor to set province neighbors. Doing it from the map file with a text editor is VERY difficult."
  },
  {
    "Friendly name": "neighbourspec",
    "description": " This command can be used to create a mountain pass or other type of special border between two provinces. Spcnbr indicates a special border types from these values: 0 = standard border"
  },
  {
    "Friendly name": "newdom ",
    "description": "Changes dominion to that of the event owner and sets it to the level of 1d(value) candles."
  },
  {
    "Friendly name": "nextingeo",
    "description": "The spell after this will also take effect if it cast in this terrain. For combat spells only."
  },
  {
    "Friendly name": "nextspell",
    "description": "With this command the effect of another spell will also take place when the effect of the main spell occurs. The nextspell takes place on every area where the main spell takes effect. So make sure the area of the second spell isnt greater than 1 or there will be overlaps."
  },
  {
    "Friendly name": "nhwound",
    "description": "The item bearer suffers a Never Healing Wound which cannot be healed until the item is removed."
  },
  {
    "Friendly name": "noaging",
    "description": "The wielder of this item has a chance of not aging each year."
  },
  {
    "Friendly name": "noagingland",
    "description": "Friendly units in the same province as this item have a chance of not aging each year."
  },
  {
    "Friendly name": "nobadevents",
    "description": "The monster will reduce the chance of negative events in his current province. The value is the percent chance of negating a possible bad event."
  },
  {
    "Friendly name": "nocastmindless",
    "description": "1 means mindless units cannot cast this spell."
  },
  {
    "Friendly name": "nocoldblood",
    "description": "The item cannot be used by coldblooded beings."
  },
  {
    "Friendly name": "nodeathsupply",
    "description": "A death scale does not adversely affect supplies. Abysia has this ability."
  },
  {
    "Friendly name": "nodemon",
    "description": "The item cannot be used by demons."
  },
  {
    "Friendly name": "nofind",
    "description": "The item cannot be found after battle."
  },
  {
    "Friendly name": "noforeignrec",
    "description": "Nation cannot recruit independent units.  These commands set the nations province defense (PD)."
  },
  {
    "Friendly name": "noforgebonus",
    "description": "Dwarven hammers and similar will not grant any rebate when used to create this item."
  },
  {
    "Friendly name": "nogeodst",
    "description": "Ritual cannot target provinces with any of these terrains. See table Terrain masks. Only used for spells that target faraway provinces"
  },
  {
    "Friendly name": "nogeosrc",
    "description": "Ritual cannot be cast from any of these terrains. See table Terrain masks."
  },
  {
    "Friendly name": "noheal",
    "description": "This monster does not heal naturally. If it is a magic being it will heal if it is located in a province with a lab."
  },
  {
    "Friendly name": "nohof",
    "description": "The monster cannot enter the Hall of Fame."
  },
  {
    "Friendly name": "nohomelandnames",
    "description": " When this switch is used"
  },
  {
    "Friendly name": "noimmobile",
    "description": "The item cannot be used by immobile beings."
  },
  {
    "Friendly name": "noinanim",
    "description": "The item cannot be used by inanimate beings."
  },
  {
    "Friendly name": "noitem",
    "description": "This monster can only use misc items."
  },
  {
    "Friendly name": "nolandtrace",
    "description": "1 = ritual range cannot trace over land 0 = ritual range can trace over land (default)"
  },
  {
    "Friendly name": "noleader",
    "description": "This monster cannot lead units when it is a commander. Use this for scouts and assassins.  Leadership Rules, Undead beings require undead leadership Demons require undead leadership Magic beings require magic leadership. Monsters that are both undead and magic being OR demon and magic being require undead leadership"
  },
  {
    "Friendly name": "nolog",
    "description": "Event does not appear in the chronicle (event history) of the province where it occurs."
  },
  {
    "Friendly name": "nomagicleader",
    "description": "This monster cannot lead magic units when it is a commander (unless it it is a mage). This is the default."
  },
  {
    "Friendly name": "nomounted",
    "description": "The item cannot be used by mounted beings."
  },
  {
    "Friendly name": "nomovepen",
    "description": "Monster ignores movement penalty from armor. This is used for chariots."
  },
  {
    "Friendly name": "nonamefilter",
    "description": " Map filter that displays province names is disabled when this command is used. Does not work correctly."
  },
  {
    "Friendly name": "nopreach",
    "description": "Priests of this nation cannot preach. Mictlan has this disadvantage."
  },
  {
    "Friendly name": "norange",
    "description": "This monster will never stay put in order to fire. Horrors with range weapons have this ability."
  },
  {
    "Friendly name": "norepel",
    "description": "This weapon cannot be used to repel attacks."
  },
  {
    "Friendly name": "noreqlab",
    "description": "Recruiting this monster never requires a lab even if it is a mage."
  },
  {
    "Friendly name": "noreqtemple",
    "description": "Recruiting the monster never requires a temple even if it is sacred."
  },
  {
    "Friendly name": "noriverpass",
    "description": "The monster is unable to cross rivers even when they are frozen like a vampire."
  },
  {
    "Friendly name": "noslowrec",
    "description": "Removes the slowrec attribute."
  },
  {
    "Friendly name": "nostart",
    "description": " Tags a province as nonstartable. No player will start here when placed at random. This command can also be set from the map editor"
  },
  {
    "Friendly name": "nostr",
    "description": "The strength of the weapon wielder will not be added to the damage. This is normally used for the weapons of mounts that have a damage value that is independent of the riders strength."
  },
  {
    "Friendly name": "notdomshape",
    "description": "The monster changes to this shape when not inside a friendly dominion."
  },
  {
    "Friendly name": "notext",
    "description": "Event does not generate a message."
  },
  {
    "Friendly name": "notfornation",
    "description": "Restricts a spell so that it cannot be used by this nation. This command can be used multiple times on the same spell."
  },
  {
    "Friendly name": "notmnr",
    "description": "This type of monster is unable to cast this ritual. Monster nbr can be negative for a montag. This command can be used multiple times on the same spell for non-montags."
  },
  {
    "Friendly name": "noundead",
    "description": "The item cannot be used by undead."
  },
  {
    "Friendly name": "noundeadgods",
    "description": "This nation cannot choose any pretender that is undead. Marignon has this feature."
  },
  {
    "Friendly name": "noundeadleader",
    "description": "This monster cannot lead undead units when it is a commander (unless it it is a death or blood mage). This is the default."
  },
  {
    "Friendly name": "nouw",
    "description": "This ranged weapon cannot be used underwater. This is the default property of all ranged weapons but the command can be used to remove the ability to fire underwater from an existing ranged weapon (e.g. lightning mind blast or ethereal crossbow)."
  },
  {
    "Friendly name": "nowatertrace",
    "description": "1 = ritual range cannot trace through water provinces 0 = Ritual range can trace through water provinces (default)"
  },
  {
    "Friendly name": "nowish",
    "description": "This monster cannot be wished for."
  },
  {
    "Friendly name": "nratt",
    "description": "Sets the number of attacks per round for a weapon. For slow missile weapons set this value to -2 for every other round or -3 for every third round."
  },
  {
    "Friendly name": "nreff",
    "description": "Sets the number of effects for this spell. For summoning spells this determines how many creatures are summoned. Add 1000 2000 or 3000 to this value to give more powerful casters more effects. Every 1000 gives one additional effect for every level of the caster. Add 500 instead to give one extra effect for every two levels the caster exceeds the requirement of the spell."
  },
  {
    "Friendly name": "nrunits",
    "description": "Number of troops in the band."
  },
  {
    "Friendly name": "okleader",
    "description": "Leadership value 40. This is the default value and it is the standard for non-elite commanders. Commander cost +30. Commanded units have a morale modifier of 0 for two or fewer squads and -1 for every additional squad."
  },
  {
    "Friendly name": "okmagicleader",
    "description": "This monster has an innate ability to command 40 magic beings. This is a very rare ability that only most magic beings possess."
  },
  {
    "Friendly name": "okundeadleader",
    "description": "This monster has an innate ability to command 40 undead beings. This is a rare ability that usually only demons or undead beings possess."
  },
  {
    "Friendly name": "older",
    "description": "Makes the monster start somewhat older or younger than its calculated or preset start age."
  },
  {
    "Friendly name": "onebattlespell",
    "description": "Monster will automatically cast this spell just before the battle starts. There is no fatigue cost. This spell cannot be a spell added by a mod it must be an original Dominions 5 spell. You can modify the spell used by this command though."
  },
  {
    "Friendly name": "onisummon",
    "description": "This unit has a chance of attracting one or more Ko-Oni per month. The Oni will only come if there is unrest or a turmoil scale in the province. The higher the unrest and turmoil the greater chance that a group of Ko-Oni will appear. The value of this ability will also modify this chance. A normal value is 50."
  },
  {
    "Friendly name": "onlyatsite",
    "description": "Ritual can only be cast in provinces containing this site."
  },
  {
    "Friendly name": "onlycoastsrc",
    "description": "1 means this ritual can only be cast from a coast province."
  },
  {
    "Friendly name": "onlycoldblood",
    "description": "The item can only be used by coldblooded beings."
  },
  {
    "Friendly name": "onlydemon",
    "description": "The item can only be used by demons."
  },
  {
    "Friendly name": "onlyfriendlydst",
    "description": "1 = can only target allied provinces 0 = turn this feature off (default)"
  },
  {
    "Friendly name": "onlygeodst",
    "description": "Ranged ritual can only target one of these terrains. See table Terrain masks. Only used for spells that target faraway provinces."
  },
  {
    "Friendly name": "onlygeosrc",
    "description": "Ritual can only be cast from one of these terrains. See table Terrain masks for possible terrain mask values."
  },
  {
    "Friendly name": "onlyinanim",
    "description": "The item can only be used by inanimate beings."
  },
  {
    "Friendly name": "onlymnr",
    "description": "Only this type of monster is able to cast this ritual. Monster nbr can be negative for a montag. This command can be used multiple times on the same spell for non-montags."
  },
  {
    "Friendly name": "onlymounted",
    "description": "The item can only be used by mounted beings."
  },
  {
    "Friendly name": "onlyowndst",
    "description": "1 = can only target own provinces 0 = can target any province (default)"
  },
  {
    "Friendly name": "onlyundead",
    "description": "The item can only be used by undead."
  },
  {
    "Friendly name": "order",
    "description": "Set special event orders that are enabled for the province (investigate, accept, decline etc). If several orders are needed to be available, add together all the mask values for the orders. The nil order resets all order options. See table below."
  },
  {
    "Friendly name": "overcharged",
    "description": "Grants the overcharged ability."
  },
  {
    "Friendly name": "owner",
    "description": " Changes the ownership of the active province. Nation nbr indicates the new owner. Nation numbers can be found in the Early Era Nations table and the three following tables."
  },
  {
    "Friendly name": "ownsmonrec",
    "description": "This monster can only be recruited if a unit of monster name type is owned by the recruiting player. Montag numbers can be used."
  },
  {
    "Friendly name": "path",
    "description": "The path of the spell OR site. \nSpell: First value should be 0 for the first required path and 1 for the second required path. The path nbr should be a number between -1 and 8. \nSite: The first value should be the path."
  },
  {
    "Friendly name": "pathboost",
    "description": "The mage who gains this event has the specified path level increased by 1, to a maximum of 5. The target of this event is set by the target requirements of the event."
  },
  {
    "Friendly name": "pathcost",
    "description": "The cost for a new path in design points when this monster is used as a god. Standard is a value between 10 (arch mage) and 80 (dragon). By using this command the monster will also be selectable as a god."
  },
  {
    "Friendly name": "pathlevel",
    "description": "Level required to cast this spell."
  },
  {
    "Friendly name": "patience",
    "description": "The patience value increases the chances of the assassin to catch his target unawares and without bodyguards. Each point of patience decreases the chance of bodyguards being present by 10%. If the bodyguard unit has the Bodyguard ability it reduces the effectiveness of the assassins Patience."
  },
  {
    "Friendly name": "patrolbonus",
    "description": "A value of ten will make this monster count as ten extra humans when it comes to patrolling. This value can also be negative for extra poor performance."
  },
  {
    "Friendly name": "pen",
    "description": "The item grants a penetration bonus that makes spells cast by the bearer harder to resist."
  },
  {
    "Friendly name": "pierce",
    "description": "The weapon does piercing damage. Monsters with Pierce Resistance only take half damage."
  },
  {
    "Friendly name": "pierceres",
    "description": "The monster takes half damage from piercing weapons."
  },
  {
    "Friendly name": "pillagebonus",
    "description": "A monster with this ability excels at pillaging. A barbarian has a pillage bonus of one which makes them count as one man extra when it comes to pillaging."
  },
  {
    "Friendly name": "plainshape",
    "description": "The monster changes to this shape when moving from a forest province to a non-forest province. If the monster also has a watershape the watershape takes precedence over the plainshape such as when moving from a forest to a water province."
  },
  {
    "Friendly name": "plant",
    "description": "The monster is a plant. Plants cannot be turned into zombies by Raise Dead or other methods."
  },
  {
    "Friendly name": "poison",
    "description": "One commander determined by target requirements is poisoned. The poison effect is armor negating but the damage will vary a bit anyway because of the usual +2d6 -2d6 calculations."
  },
  {
    "Friendly name": "poisonarmor",
    "description": "Anyone striking this monster with short weapons will be poisoned."
  },
  {
    "Friendly name": "poisoncloud",
    "description": "Monster is surrounded by a poison cloud. Standard size is 6."
  },
  {
    "Friendly name": "poisonres",
    "description": "The item grants a Poison Resistance bonus."
  },
  {
    "Friendly name": "poisonskin",
    "description": "The monster has a skin that exudes a paralyzing poison which does fatigue damage to anyone attacking it with length 0 weapons. The value is the damage rating of the poison."
  },
  {
    "Friendly name": "polygetmagic",
    "description": "1 means a unit polymorphed by this ritual will get the magic of the target creature."
  },
  {
    "Friendly name": "polyimmune",
    "description": "This monster cannot be polymorphed in combat."
  },
  {
    "Friendly name": "pooramphibian",
    "description": "This monster can travel under water but is hindered by it."
  },
  {
    "Friendly name": "poorleader",
    "description": "Leadership value 10. This is the standard value for mages. Commander cost +15. Commanded units have a morale modifier of -1 if in a single squad and an additional -1 for every additional squad."
  },
  {
    "Friendly name": "poormagicleader",
    "description": "This monster has an innate ability to command 10 magic beings. This is a very rare ability that only most magic beings possess."
  },
  {
    "Friendly name": "poorundeadleader",
    "description": "This monster has an innate ability to command 10 undead beings. This is a rare ability that usually only demons or undead beings possess."
  },
  {
    "Friendly name": "popkill",
    "description": "The monster kills [10 x amount] of population in the province it resides in every month. This applies to both commander and non-commander units with this attribute."
  },
  {
    "Friendly name": "poppergold",
    "description": "The amount of people required for one gold in taxes. Default is 100."
  },
  {
    "Friendly name": "poptype",
    "description": " Sets the population type of the active province. This determines which troops may be recruited in the province. Poptype numbers can be found in the large table on the following page. If poptype is set with a number higher than existing poptypes"
  },
  {
    "Friendly name": "population",
    "description": " Sets the population number of the active province."
  },
  {
    "Friendly name": "prec",
    "description": "The item grants a precision bonus."
  },
  {
    "Friendly name": "precision",
    "description": "Set the precision for this spell."
  },
  {
    "Friendly name": "priestreanim",
    "description": "All priests of this nation are able to reanimate the dead as if the had the #reanimpriest attribute. They also gain the 15 points of undead leadership per holy magic level they would have received from that attribute."
  },
  {
    "Friendly name": "prophetshape",
    "description": "Unit will change into this monster when made a prophet. Monster nbr can be negative for montag usage."
  },
  {
    "Friendly name": "prot",
    "description": "The monsters natural protection. This value should be 0 for all humans 5 for a lizardman or about 18 for a huge and scaly dragon."
  },
  {
    "Friendly name": "provrange",
    "description": "Sets the range of a ritual in provinces."
  },
  {
    "Friendly name": "purgecalendar",
    "description": "Removes an event determined by attr from the global event calendar.  1 = the event that had been added after this event would be affected. 0 = current event -1 = the previous event. The event calendar contains the planned global events that will occur in the coming 7 months."
  },
  {
    "Friendly name": "purgedelayed",
    "description": "Removes an event from the delayed event list (same attr as previous command). Delayed events are events added by the #delay command."
  },
  {
    "Friendly name": "quadruped",
    "description": "Four legged beasts. Use this for Elephants lions wolves and similar."
  },
  {
    "Friendly name": "quickness",
    "description": "The item grants Quickness (double movement +2 attack & defense attacks twice as often)."
  },
  {
    "Friendly name": "raiseonkill",
    "description": "Monster has a chance in percent to raise the people it kills as soulless."
  },
  {
    "Friendly name": "raiseshape",
    "description": "Changes soulless to another kind of unit for the #raiseonkill or #dt_raise effects. Monster number can be negative for montag usage."
  },
  {
    "Friendly name": "randequip",
    "description": "How powerful magic equipment the commander will have. 0=none 3=extremely powerful stuff."
  },
  {
    "Friendly name": "randomequip",
    "description": " Gives random magic items to the active commander. Rich must be between 0 and 4. A value of 0 means small chance of getting a magic item and 4 means large chance of getting many powerful items."
  },
  {
    "Friendly name": "randomspell",
    "description": "The monster has a"
  },
  {
    "Friendly name": "range",
    "description": "Sets the battlefield range for this spell. Add 5000 to this value to give longer range (5 extra per level) to more powerful casters."
  },
  {
    "Friendly name": "range0",
    "description": "This ranged weapon can also be used in melee."
  },
  {
    "Friendly name": "range050",
    "description": "This ranged weapon has a 50% chance of being used in melee."
  },
  {
    "Friendly name": "raredomsummon",
    "description": "There is a flat 8% chance of summoning one creature of this type when in a province with friendly dominion."
  },
  {
    "Friendly name": "rarity",
    "description": "Sets the rarity of the event. Normal events should use number 1, 2, -1, -2, -11 or -12. The other numbers are always events that are best used for creating global enchantment effects or special dominion effects."
  },
  {
    "Friendly name": "rcost",
    "description": "The cost in resources. The resource cost of weapons and armor will be added to this. Most human troops have a rcost of one. Heavy cavalry have a base rcost of 8 - 20 (to represent the barding of the mount) combined with #ressize 2 for human-sized armor and weapons."
  },
  {
    "Friendly name": "reanimator",
    "description": "The monster will reanimate this number of corpses automatically every turn."
  },
  {
    "Friendly name": "reanimpriest",
    "description": "A priest with this attribute will be able to raise undead."
  },
  {
    "Friendly name": "recallgod",
    "description": "The nation is better at Call God than other nations. This value is added to the priest level of all priests when they perform Call God."
  },
  {
    "Friendly name": "reclimit",
    "description": "The monster can only be recruited in limited numbers. You can only recruit"
  },
  {
    "Friendly name": "recrate",
    "description": "The rate at which new troops are bought. A value of 100 means one per month."
  },
  {
    "Friendly name": "recuperation",
    "description": "The item grants the recuperation ability."
  },
  {
    "Friendly name": "reform",
    "description": "This is a combat ability. The monster has this chance of getting a new healthy body when killed."
  },
  {
    "Friendly name": "reformtime",
    "description": " Alters the time taken to reform the immortalâ€™s body. The standard time is 3 months, use #reformtime -2 if you want the immortal to reappear the next month."
  },
  {
    "Friendly name": "regeneration",
    "description": "The monster regenerates like a troll and heals damage every combat round. The percent value indicates how many percent of its total hit points are regenerated every turn. The standard value for regeneration is 10."
  },
  {
    "Friendly name": "reinvigoration",
    "description": "Reduces the fatigue by points amount every turn in battle. This value can be negative to gain extra fatigue in battle instead. Lower fatigue reduces the chance of the monster suffering critical hits while higher fatigue increases it."
  },
  {
    "Friendly name": "removesite",
    "description": "Removes a site from the province. Use -1 for site number to place [sitename] instead. [sitename] must be added to event message text in brackets. The site will be be removed regardless of being found or not."
  },
  {
    "Friendly name": "req_2monsters",
    "description": "This monster must be present in the province and there must be at least 2 of them."
  },
  {
    "Friendly name": "req_5monsters",
    "description": "This monster must be present in the province and there must be at least 5 of them."
  },
  {
    "Friendly name": "req_anycode",
    "description": "Event code must be present somewhere in the world. Can be used multiple times for an event. If the command is used multiple times, one of the codes being present is sufficient to fulfill the requirement."
  },
  {
    "Friendly name": "req_arenadone",
    "description": "The will require that an arena battle has taken place (been resolved) earlier this turn. If set to zero an arena battle must not have taken place."
  },
  {
    "Friendly name": "req_capital",
    "description": "Event can only happen in capital provinces. This includes conquered capital provinces.  1 = only in capitals 0 = never in capitals"
  },
  {
    "Friendly name": "req_cave",
    "description": "Event requires the province to have cave terrain. 1 = must be cave, 0 = cannot be cave."
  },
  {
    "Friendly name": "req_chaos",
    "description": "Turmoil scale required."
  },
  {
    "Friendly name": "req_claimedthrone",
    "description": "The throne [sitename] must be claimed by someone. Combine with #req_site to target the throne province."
  },
  {
    "Friendly name": "req_coast",
    "description": "Event requires the province to have coastal terrain. 1 = must be coast, 0 = cannot be coast."
  },
  {
    "Friendly name": "req_code",
    "description": "Province must have this event code. Can be used multiple times for an event. If the command is used multiple times, one of the codes being present is sufficient to fulfill the requirement. Use #req_code 0 for events that generate event codes. Otherwise they may break ongoing event chains."
  },
  {
    "Friendly name": "req_cold",
    "description": "Cold scale required."
  },
  {
    "Friendly name": "req_commander",
    "description": "There must be a non-sneaking commander present for the event to happen. 1 = yes, 0 = no."
  },
  {
    "Friendly name": "req_deadmnr",
    "description": "This monster must be present or be among the dead monsters or the event cannot happen. Unique monsters and heroes stay among the dead monsters when they are killed, ordinary monsters are purged from memory when they are killed. Use this command to see if a unique monster has ever been summoned to the game."
  },
  {
    "Friendly name": "req_death",
    "description": "Death scale required."
  },
  {
    "Friendly name": "req_domchance",
    "description": "Requires a dominion and the higher dominion the higher the chance of this event happening. The owner of the dominion, friendly or not, does not matter for this command. The event will have dominion value * this value % chance of happening (if it should have happened without this command that is). This command can be used to create global enchantments that have the chance of something happening scale with dominion strength."
  },
  {
    "Friendly name": "req_dominion",
    "description": "The province must have the owners dominion at  candles or more."
  },
  {
    "Friendly name": "req_domowner",
    "description": "The event requires this nation to have dominion in the province."
  },
  {
    "Friendly name": "req_ench",
    "description": "This enchantment must be active."
  },
  {
    "Friendly name": "req_enchdom",
    "description": "This enchantment must be active and in its owners dominion."
  },
  {
    "Friendly name": "req_era",
    "description": "Can only happen in this era.  1 = early 2 = mid 3 = late"
  },
  {
    "Friendly name": "req_farm",
    "description": "Event requires the province to have farm terrain. 1 = must be farm, 0 = cannot be farm."
  },
  {
    "Friendly name": "req_forest",
    "description": "Event requires the province to have forest terrain. 1 = must be forest, 0 = cannot be forest."
  },
  {
    "Friendly name": "req_fornation",
    "description": "The event can only happen for this nation. This command can be used multiple times for the same event to enable it for multiple nations."
  },
  {
    "Friendly name": "req_fort",
    "description": "There must be a fort in the province. 1 = yes, 0 = no"
  },
  {
    "Friendly name": "req_foundsite",
    "description": "Event requires [sitename] to be in the province and discovered."
  },
  {
    "Friendly name": "req_freesites",
    "description": "The province must have at least  free site slots for the event to happen. Remember to use this requirement if the event creates a site."
  },
  {
    "Friendly name": "req_freshwater",
    "description": "Event requires the province to have fresh water. 1 = must have fresh water, 0 = cannot have fresh water."
  },
  {
    "Friendly name": "req_friendlyench",
    "description": "This enchantment must be active and friendly."
  },
  {
    "Friendly name": "req_fullowner",
    "description": "The event requires this nation to control the province, any fort (if present) and to have positive dominion in the province."
  },
  {
    "Friendly name": "req_gem",
    "description": "There must be at least one gem of the required type in the gem treasury. Gem types are listed in the table below."
  },
  {
    "Friendly name": "req_godismnr",
    "description": "Requires the event owners Pretender God (or Disciple) to be a specific monster type.  Events with scale requirements can only trigger if the province has the required scale at the required level. The value for scale requirements can range from -3 to 3. When a negative number is used as an argument, the event can happen in the opposite scale as well.  For example, #req_growth -1 would allow the event to happen if the province has a Growth / Death scale of Death 1, neutral or any level of Growth, but cannot happen if the scale value is Death 2 or Death 3."
  },
  {
    "Friendly name": "req_gold",
    "description": "The nation must have at least this much gold in the treasury."
  },
  {
    "Friendly name": "req_growth",
    "description": "Growth scale required."
  },
  {
    "Friendly name": "req_heat",
    "description": "Heat scale required."
  },
  {
    "Friendly name": "req_hiddensite",
    "description": "Event requires [sitename] to be in the province and not discovered."
  },
  {
    "Friendly name": "req_hostileench",
    "description": "This enchantment must be active and hostile."
  },
  {
    "Friendly name": "req_humanoidres",
    "description": "There must be a humanoid researcher present in the province for the event to happen."
  },
  {
    "Friendly name": "req_indepok",
    "description": "Event can also happen to independents. 1 = yes, 0 = no."
  },
  {
    "Friendly name": "req_lab",
    "description": "There must be a lab in the province. 1 = yes, 0 = no"
  },
  {
    "Friendly name": "req_land",
    "description": "Event requires land province. 1 = land, 0 = sea."
  },
  {
    "Friendly name": "req_lazy",
    "description": "Sloth scale required."
  },
  {
    "Friendly name": "req_luck",
    "description": "Luck scale required."
  },
  {
    "Friendly name": "req_magic",
    "description": "Magic scale required.  The argument of  means monster name or monster number."
  },
  {
    "Friendly name": "req_maxdef",
    "description": "There may not be more than  PD in the province for the event to happen. The value varies with +/- 25%."
  },
  {
    "Friendly name": "req_maxdominion",
    "description": "The province must have a dominion strength of no more than  for the event to happen. Negative values can be used and mean that enemy dominion of that strength or stronger is required for the event to happen."
  },
  {
    "Friendly name": "req_maxpop",
    "description": "There may not be more than this amount of population in the province. One dekapop = 10 population in game."
  },
  {
    "Friendly name": "req_maxtroops",
    "description": "There may not be more than this many troops in the province for the event to happen."
  },
  {
    "Friendly name": "req_maxturn",
    "description": "The event cannot happen after this turn."
  },
  {
    "Friendly name": "req_maxunrest",
    "description": "There cannot be more than  unrest in the province for the event to happen. The value varies with +/- 25%."
  },
  {
    "Friendly name": "req_mindef",
    "description": "There must be at least  PD in the province for the event to happen. The value varies with +/- 25%."
  },
  {
    "Friendly name": "req_minpop",
    "description": "There must be at least this much population in the province."
  },
  {
    "Friendly name": "req_mintroops",
    "description": "There must be at least this many troops in the province for the event to happen."
  },
  {
    "Friendly name": "req_minunrest",
    "description": "There must be at least  unrest in the province for the event to happen. The value varies with +/- 25%."
  },
  {
    "Friendly name": "req_mnr",
    "description": "This monster must be present somewhere in the world or the event cannot happen. The command can be used multiple times and then all of the monsters must be in the world."
  },
  {
    "Friendly name": "req_monster",
    "description": "This monster must be present in the province."
  },
  {
    "Friendly name": "req_mountain",
    "description": "Event requires the province to have mountain or border mountain terrain. 1 = must be mountain, 0 = cannot be mountain."
  },
  {
    "Friendly name": "req_mydominion",
    "description": "Event requires province owners dominion. 0 = must not have owners dominion."
  },
  {
    "Friendly name": "req_myench",
    "description": "This enchantment must be active and owned by the event owner."
  },
  {
    "Friendly name": "req_nation",
    "description": "This nation must be in play for the event to happen."
  },
  {
    "Friendly name": "req_nearbycode",
    "description": "Event code must be present in a neighboring province."
  },
  {
    "Friendly name": "req_nearbysite",
    "description": "Event requires [sitename] to be in the province or adjacent provinces."
  },
  {
    "Friendly name": "req_nearowncode",
    "description": "Current province or neighboring province owned by the same player must have this event code.  4.12 Enchantment Requirements These commands are intended for global enchantment creation."
  },
  {
    "Friendly name": "req_noench",
    "description": "This enchantment cannot be active."
  },
  {
    "Friendly name": "req_noera",
    "description": "Cannot happen in this era."
  },
  {
    "Friendly name": "req_nomnr",
    "description": "This monster must not be present in the world or the event cannot happen. This requirement is best used with unique monsters or national heroes. This command can be used multiple times and then none of the monsters may be in the world.  For example, #req_nomnr 563 would require the Queen of Storms to not have been summoned yet. If she has already been summoned, the event can no longer happen. If she is killed, the event can happen again until she is summoned once more."
  },
  {
    "Friendly name": "req_nomonster",
    "description": "This monster cannot be present in the province."
  },
  {
    "Friendly name": "req_nonation",
    "description": "If this nation is in play the event cannot occur."
  },
  {
    "Friendly name": "req_nopathair",
    "description": "There cannot be an Air mage of this level or higher in the province."
  },
  {
    "Friendly name": "req_nopathall",
    "description": "There cannot be a mage or priest of any kind of this level or higher in the province.  A single commander must fulfill all target requirements for the event to occur. Some commands may be used multiple times with different values (e.g. Monster types), in which case one of the conditions being present fulfills that requirement."
  },
  {
    "Friendly name": "req_nopathastral",
    "description": "There cannot be an Astral mage of this level or higher in the province."
  },
  {
    "Friendly name": "req_nopathblood",
    "description": "There cannot be a Blood mage of this level or higher in the province."
  },
  {
    "Friendly name": "req_nopathdeath",
    "description": "There cannot be a Death mage of this level or higher in the province."
  },
  {
    "Friendly name": "req_nopathearth",
    "description": "There cannot be an Earth mage of this level or higher in the province."
  },
  {
    "Friendly name": "req_nopathfire",
    "description": "There cannot be a Fire mage of this level or higher in the province."
  },
  {
    "Friendly name": "req_nopathholy",
    "description": "There cannot be a Priest of this level or higher in the province."
  },
  {
    "Friendly name": "req_nopathnature",
    "description": "There cannot be a Nature mage of this level or higher in the province."
  },
  {
    "Friendly name": "req_nopathwater",
    "description": "There cannot be a Water mage of this level or higher in the province."
  },
  {
    "Friendly name": "req_noseason",
    "description": "The event cannot happen in this season."
  },
  {
    "Friendly name": "req_nositenbr",
    "description": "There cannot be this site in the province. If there is, the event cannot happen. This command only accepts the site number as an attribute."
  },
  {
    "Friendly name": "req_notanycode",
    "description": "Event code must not be present in the world. Can be used multiple times for an event. If the command is used multiple times, none of the codes may be present."
  },
  {
    "Friendly name": "req_notforally",
    "description": "This nation and its allies cannot receive the event. In a non-disciple game this will have the same effect as req_notfornation."
  },
  {
    "Friendly name": "req_notfornation",
    "description": "This nation cannot receive the event. The old variant req_notnation can also be used for the same effect."
  },
  {
    "Friendly name": "req_notnation",
    "description": "This nation cannot receive the event. OLD VARIANT"
  },
  {
    "Friendly name": "req_noworlditem",
    "description": "If you figure this one out please tell me so I can add it. "
  },
  {
    "Friendly name": "req_order",
    "description": "Order scale required."
  },
  {
    "Friendly name": "req_owncapital",
    "description": "Event can only happen in event owners own capital province.  1 = only in event owners capital 0 = never in event owners capital"
  },
  {
    "Friendly name": "req_pathair",
    "description": "There must be an Air mage of at least this level in the province."
  },
  {
    "Friendly name": "req_pathastral",
    "description": "There must be an Astral mage of at least this level in the province."
  },
  {
    "Friendly name": "req_pathblood",
    "description": "There must be a Blood mage of at least this level in the province."
  },
  {
    "Friendly name": "req_pathdeath",
    "description": "There must be a Death mage of at least this level in the province."
  },
  {
    "Friendly name": "req_pathearth",
    "description": "There must be an Earth mage of at least this level in the province."
  },
  {
    "Friendly name": "req_pathfire",
    "description": "There must be a Fire mage of at least this level in the province."
  },
  {
    "Friendly name": "req_pathholy",
    "description": "There must be a Priest of at least this level in the province."
  },
  {
    "Friendly name": "req_pathnature",
    "description": "There must be a Nature mage of at least this level in the province."
  },
  {
    "Friendly name": "req_pathwater",
    "description": "There must be a Water mage of at least this level in the province."
  },
  {
    "Friendly name": "req_permonth",
    "description": "This event can only happen  times per month."
  },
  {
    "Friendly name": "req_pop0ok",
    "description": "The event can also happen in provinces with no population. Standard events are limited to provinces with at least 50 population (5 dekapop)."
  },
  {
    "Friendly name": "req_poptype",
    "description": "The province must have the correct poptype."
  },
  {
    "Friendly name": "req_preach",
    "description": "Event has a chance of  per priest level of happening when a priest is present and preaching the teachings of his god."
  },
  {
    "Friendly name": "req_pregame",
    "description": "The event can happen before the first turn, right after the game has been created, but it will never occur otherwise. The message from this events will show up on the first turn of the game. There are no events like this in the standard game (unless you count the two introduction messages), but it can be used to create special start conditions for mods. These events must have an \\u2018always rarity as no normal events will occur before the first turn."
  },
  {
    "Friendly name": "req_prod",
    "description": "Production scale required."
  },
  {
    "Friendly name": "req_rare",
    "description": "The event is extra rare and only has a  chance of being valid when rolled. An always event can be combined with #req_rare to set its chance of happening (per province)."
  },
  {
    "Friendly name": "req_researcher",
    "description": "There must be a researcher present in the province for the event to happen."
  },
  {
    "Friendly name": "req_season",
    "description": "Event requires this season to happen.  0 = spring 1 = summer 2 = fall 3 = winter"
  },
  {
    "Friendly name": "req_site",
    "description": "Event requires [sitename] to be in the province. It can be discovered or hidden."
  },
  {
    "Friendly name": "req_story",
    "description": "Event only happens when story events are enabled. 1 = yes, 0 = no."
  },
  {
    "Friendly name": "req_swamp",
    "description": "Event requires the province to have swamp. 1 = must be swamp, 0 = cannot be swamp."
  },
  {
    "Friendly name": "req_targaff",
    "description": "Target must have this affliction."
  },
  {
    "Friendly name": "req_targally",
    "description": "If you figure this one out please tell me so I can add it. "
  },
  {
    "Friendly name": "req_targanimal",
    "description": "Target must (not) be an animal."
  },
  {
    "Friendly name": "req_targdemon",
    "description": "Target must (not) be a demon."
  },
  {
    "Friendly name": "req_targforeignok",
    "description": "Indicates that the target can be owned by someone else than the owner of the land. The default (without this command) is that all req_targ\\u2026 commands only target commanders that are owned by the player that owns the land where the event occurs."
  },
  {
    "Friendly name": "req_targgod",
    "description": "Target must be god.  1 = must be pretender or disciple 0 = cannot be pretender or disciple"
  },
  {
    "Friendly name": "req_targhumanoid",
    "description": "Sets item slot requirement for target.  1 = must have hands 0 = must not have hands"
  },
  {
    "Friendly name": "req_targimmobile",
    "description": "Target must (not) be immobile."
  },
  {
    "Friendly name": "req_targinanimate",
    "description": "Target must (not) be an inanimate being."
  },
  {
    "Friendly name": "req_targitem",
    "description": "Target must have this magic item."
  },
  {
    "Friendly name": "req_targmagicbeing",
    "description": "Target must (not) be a magic being."
  },
  {
    "Friendly name": "req_targmale",
    "description": "Sets targets gender requirement.  1 = must be male 0 = must be female"
  },
  {
    "Friendly name": "req_targmaxsize",
    "description": "Target must be this size of smaller.  These commands set event code requirements that must be fulfilled for the event to take place. They are generally used in event chains where the event requires another event to have taken place previously.  There is a risk of incompatible mods if the same event codes are used across different mods!  Please use only negative event codes from -300 and downwards, or it may interfere with the events in the vanilla game (except for 0, which is default)."
  },
  {
    "Friendly name": "req_targmindless",
    "description": "Target must (not) be mindless."
  },
  {
    "Friendly name": "req_targminsize",
    "description": "Target must be this size or larger."
  },
  {
    "Friendly name": "req_targmnr",
    "description": "Target commander must be this monster type. This command can be used multiple times."
  },
  {
    "Friendly name": "req_targnoaff",
    "description": "If you figure this one out please tell me so I can add it. "
  },
  {
    "Friendly name": "req_targnoitem",
    "description": "Target must not have this magic item."
  },
  {
    "Friendly name": "req_targnomnr",
    "description": "Target commander mustnt be this monster type. This command can be used multiple times."
  },
  {
    "Friendly name": "req_targnoorder",
    "description": "If you figure this one out please tell me so I can add it. "
  },
  {
    "Friendly name": "req_targnopath1",
    "description": "Must have level 0 in target magic path."
  },
  {
    "Friendly name": "req_targnopath2",
    "description": "Must have level 0-1 in target magic path."
  },
  {
    "Friendly name": "req_targnopath3",
    "description": "Must have level 0-2 in target magic path."
  },
  {
    "Friendly name": "req_targnopath4",
    "description": "Must have level 0-3 in target magic path."
  },
  {
    "Friendly name": "req_targnotally",
    "description": "If you figure this one out please tell me so I can add it. "
  },
  {
    "Friendly name": "req_targnotowner",
    "description": "If you figure this one out please tell me so I can add it. "
  },
  {
    "Friendly name": "req_targorder",
    "description": "Target must be performing these orders. This command can be used multiple times, in which case one of the conditions being present is sufficient to fulfill the requirement. Target orders are listed in the table below."
  },
  {
    "Friendly name": "req_targowner",
    "description": "Target must owned by this nation. Negative nation number cannot be used and the command can only be used once per event."
  },
  {
    "Friendly name": "req_targpath1",
    "description": "Must have level 1+ in target magic path."
  },
  {
    "Friendly name": "req_targpath2",
    "description": "Must have level 2+ in target magic path."
  },
  {
    "Friendly name": "req_targpath3",
    "description": "Must have level 3+ in target magic path."
  },
  {
    "Friendly name": "req_targpath4",
    "description": "Must have level 4+ in target magic path."
  },
  {
    "Friendly name": "req_targprophet",
    "description": "Target must be a prophet.  1 = must be a prophet 0 = cannot be a prophet"
  },
  {
    "Friendly name": "req_targundead",
    "description": "Target must (not) be an undead."
  },
  {
    "Friendly name": "req_temple",
    "description": "There must be a temple in the province. 1 = yes, 0 = no"
  },
  {
    "Friendly name": "req_turn",
    "description": "The event cannot happen before this turn."
  },
  {
    "Friendly name": "req_unclaimedthrone",
    "description": "The throne [sitename] must be present in the game and unclaimed. Combine with #req_site to target the throne province."
  },
  {
    "Friendly name": "req_unique",
    "description": "The event can only happen  times during the course of the game."
  },
  {
    "Friendly name": "req_unluck",
    "description": "Misfortune scale required."
  },
  {
    "Friendly name": "req_unmagic",
    "description": "Drain scale required."
  },
  {
    "Friendly name": "req_waste",
    "description": "Event requires the province to have waste terrain. 1 = must be waste, 0 = cannot be waste."
  },
  {
    "Friendly name": "req_worlditem",
    "description": "If you figure this one out please tell me so I can add it. "
  },
  {
    "Friendly name": "reqeyes",
    "description": "The item can only be used by a being with eyes."
  },
  {
    "Friendly name": "reqlab",
    "description": "Recruiting the monster requires a lab."
  },
  {
    "Friendly name": "reqnoplant",
    "description": "If you figure this one out please tell me so I can add it. "
  },
  {
    "Friendly name": "reqplant",
    "description": "If you figure this one out please tell me so I can add it. "
  },
  {
    "Friendly name": "reqseduce",
    "description": "Only units with the seduce ability can cast this ritual."
  },
  {
    "Friendly name": "reqspellsinger",
    "description": "Only units with the spell singing ability can cast this ritual."
  },
  {
    "Friendly name": "reqtaskmaster",
    "description": "Only units with the task master ability can cast this ritual."
  },
  {
    "Friendly name": "reqtemple",
    "description": "Recruiting the monster requires a temple."
  },
  {
    "Friendly name": "res",
    "description": "Adds a resource bonus to the site."
  },
  {
    "Friendly name": "researchaff",
    "description": "A researcher suffers an affliction."
  },
  {
    "Friendly name": "researchbonus",
    "description": "Makes a commander better or worse at magic research. A sage has a value of 8."
  },
  {
    "Friendly name": "researchlevel",
    "description": "Level of research required to learn this spell. The level should be a number between 0 and 9."
  },
  {
    "Friendly name": "researchscale",
    "description": "The amount of research bonus received per mage from a magic scale of +3. Default is 3."
  },
  {
    "Friendly name": "resetcode",
    "description": "Removes this event code from the entire world."
  },
  {
    "Friendly name": "resetcodedelay",
    "description": "Removes this event code from the entire world, but not immediately. It will be removed after all events have been executed this turn."
  },
  {
    "Friendly name": "resetcodedelay2",
    "description": "Removes this event code from the entire world, but not immediately. It will be removed after all events have been executed on the next turn."
  },
  {
    "Friendly name": "resolvearena1",
    "description": "The area battles will be resolved and the winner rewarded. This event (or #resolvearena2) must occur the turn after the #arena event occurred."
  },
  {
    "Friendly name": "resolvearena2",
    "description": "Same as #resolvearena1, but it will be an arena where the use of magic is prohibited."
  },
  {
    "Friendly name": "resourcemult",
    "description": "A multiplier for the amount of resource found in a land. Default is 100."
  },
  {
    "Friendly name": "resources",
    "description": "The monster generates"
  },
  {
    "Friendly name": "ressize",
    "description": "Use this command with a size value of 2 to give a cavalryman resource cost calculated based on size 2 instead of 3. Size value must be a number between 1 and 6."
  },
  {
    "Friendly name": "restricted",
    "description": " This item or spell is restrcited to this nation only. For spells you can use this up to 12 times per spell. You can reuse this an unknown amount of times per item. A value of -1 restricts the spell or item to the last manipulated nation so this command can be used with #newnation."
  },
  {
    "Friendly name": "restricteditem",
    "description": "This item can only be used by monsters with the proper #userestricteditem ability value."
  },
  {
    "Friendly name": "revealprov",
    "description": "The name of the province is revealed to the entire world."
  },
  {
    "Friendly name": "revealsite",
    "description": "Reveals the site called [sitename] in the province. [sitename] must be added to the event message text in brackets."
  },
  {
    "Friendly name": "revolt",
    "description": "Province revolts and turns independent."
  },
  {
    "Friendly name": "riverstart",
    "description": "This nation doesnt mind starting surrounded by rivers. Ctis has this ability."
  },
  {
    "Friendly name": "rockcol",
    "description": " Color the world with the specified colors for fights in the current province. Color values range from 0 to 255."
  },
  {
    "Friendly name": "rpcost",
    "description": "The cost in recruitment points for the monster. 1 is standard for a simple commander and about 10 for a normal soldier.  A value of base price*1000 means it will be auto-calculated. Most human troops and commander have the value 10000 meaning that it will be calculated automatically based on the monsters age and that it has a base price of 10 gold commanders also have magic and other skills taken into account."
  },
  {
    "Friendly name": "run",
    "description": "The bearer of the item is able to move further on the battlefield (double combat speed)."
  },
  {
    "Friendly name": "sacredonly",
    "description": "The weapon only affects sacred troops."
  },
  {
    "Friendly name": "sacrificedom",
    "description": "Priests of this nation can make blood sacrifices to increase dominion. Mictlan has this benefit."
  },
  {
    "Friendly name": "saildist",
    "description": " Sets the maximum sail distance in sea provinces. A commander with the sailing ability will be able to pass this many sea provinces. It default to 2"
  },
  {
    "Friendly name": "sailing",
    "description": "A commander with this ability is able to sail over two sea provinces with his troops. Ship size is the size of the boat and indicates how many size points the commander can transport. Standard value is 999. Max unit size is the maximum size unit that can be transported usually 2 or 3."
  },
  {
    "Friendly name": "saltvul",
    "description": "Units with this trait can take the listed value at most in Damage, when hit by the Enchanted Salt attack.  For those who don't know, the actual Damage you take from Salt is capped after its Damage Roll, and independently from its attack Damage (which is 1). For units without Salt Vulnerability, the cap is zero.  Salt can also Stun Vulnerable and non-Vulnerable targets, with the same chances as Shock Damage. The Stun chance is calculated before Salt Vulnerability is taken into account."
  },
  {
    "Friendly name": "sample",
    "description": "Uses this sample as sound effect for when the spell is cast. The sample must be in .sw (16-bit signed words 22050 Hz mono) or .al (a-law 22050 Hz mono) format. This command can also be used for weapons."
  },
  {
    "Friendly name": "scalewalls",
    "description": "The monster can assassinate commanders even when they are in besieged castles."
  },
  {
    "Friendly name": "scenario",
    "description": " This command tags the map as a scenario and this will be indicated by a small burning star when selecting a map. It disables most game setup options"
  },
  {
    "Friendly name": "school",
    "description": "Magic school for this spell. The number ranges from -1 to 7 see Table Magic path numbers for spells."
  },
  {
    "Friendly name": "scry",
    "description": "A mage with the same path as the site may enter to scry a distant province. The scrying is a magic ritual which provides accurate scouting information on the province for"
  },
  {
    "Friendly name": "scryrange",
    "description": "Set the maximum range of the scry ability. If not set a maximum range of 6 provinces will be used."
  },
  {
    "Friendly name": "secondarycolor",
    "description": "The animated background is made up of two colors the primary color (from #color) and this one. If the secondary color is not set it will be the same as the primary."
  },
  {
    "Friendly name": "secondaryeffect",
    "description": "This secondary effect will affect anyone harmed by the weapon. See Table secondary weapon effects for some premade effects. The effects are also weapons and share the same numbers as all other weapons and you can create a new secondary effect by creating a new weapon."
  },
  {
    "Friendly name": "secondaryeffectalways",
    "description": "This secondary effect will affect anyone attacked by the weapon no matter if it was a hit or not as long as the secondary effect itself has an area of effect of one or greater. If the secondary effect does not have an area of effect it will activate when the target is hit even if actual damage is not inflicted. See table secondary weapon effects for some premade effects. Only one of #secondaryeffectalways and #secondaryeffect can be used. You must use the always variant with area effects. For non-area effects either one can be used but you usually want the non-always variant for these weapons."
  },
  {
    "Friendly name": "secondarylevel",
    "description": "Secondary path level requirement to forge this magic item. Works like #mainlevel."
  },
  {
    "Friendly name": "secondarypath",
    "description": "Secondary path required to forge this magic item. The path is a number from -1 to 7 from Table 20."
  },
  {
    "Friendly name": "secondshape",
    "description": "This monster will assume another shape when it gets seriously wounded. Remember to give the other shape the #firstshape command if you want it to return to the primary form when it feels better. Werewolves in human form use this ability. Monster nbr can be negative for montags."
  },
  {
    "Friendly name": "secondtmpshape",
    "description": "This monster will transform into another monster when it is killed in battle. This other monster will be removed after battle. Serpent Cataphracts use this ability. Monster nbr can be negative for montags."
  },
  {
    "Friendly name": "seduce",
    "description": "Gives the monster the ability to seduce like a Nagini. The value indicates the difficulty of the morale check 10 is standard."
  },
  {
    "Friendly name": "sethome",
    "description": "The commander casting this ritual will get his home province set to the current province."
  },
  {
    "Friendly name": "setland",
    "description": " Sets the active province. All the following commands will only affect the active province."
  },
  {
    "Friendly name": "shapechance",
    "description": "may be x% chance to enter or skip secondshapes"
  },
  {
    "Friendly name": "shapechange",
    "description": "This monster is able to change shape to and from another monster at will. The other monster is not affected by this command and must be given #shapechange command with the first form as the value. Dragons use this ability. It is also possible to do multiple form shape changers such as the Jotun Skratti by chaining this command over several monsters."
  },
  {
    "Friendly name": "shatteredsoul",
    "description": "The monster suffers from a shattered soul like a Tartarian. There is a"
  },
  {
    "Friendly name": "shock",
    "description": "This weapon does shock damage. A shock resistant being will take reduced damage from this weapon."
  },
  {
    "Friendly name": "shockres",
    "description": "The item grants a Shock Resistance bonus."
  },
  {
    "Friendly name": "shrinkhp",
    "description": "The monster shrinks to the following monster once it has this many hit points or less. Hydras use this mechanic."
  },
  {
    "Friendly name": "siegebonus",
    "description": "A value of ten will make this monster count as ten extra humans when it comes to breaking down castle gates."
  },
  {
    "Friendly name": "singlebattle",
    "description": "The monster only fights in one battle and then leaves like the gladiators of Ermor and Pythium. It has to kill someone or get wounded to count as having fought."
  },
  {
    "Friendly name": "size",
    "description": "The size of the monster.  1 = hoburg 2 = human 3 = shambler cavalry 4 = giant chariot 5 = giant lobster 6 = dragon sphinx."
  },
  {
    "Friendly name": "sizeresist",
    "description": "Units that are size 3 or 4 have a chance of resisting the effects of the weapon. Size 5+ units always resist the effects and size 1 and 2 units never resist the effect. Str 15+ also has a chance to resist and Str 35+ always resists."
  },
  {
    "Friendly name": "skip",
    "description": "Once this weapon is used skip the next weapon."
  },
  {
    "Friendly name": "skip2",
    "description": "Once this weapon is used skip the next 2 weapons."
  },
  {
    "Friendly name": "skirmisher",
    "description": "Units in Skirmish formation suffer a -1 penalty to Morale, unless they have the Skirmisher trait. <-25 - 25>"
  },
  {
    "Friendly name": "skybox",
    "description": " Sets the sky (battleground background) to a tga/rgb pic of your choice for fights in the current province. The picture size should be a power of two. 512*512 is a good size."
  },
  {
    "Friendly name": "slash",
    "description": "The weapon does slashing damage. Monsters with Slash Resistance only take half damage."
  },
  {
    "Friendly name": "slashres",
    "description": "The monster takes half damage from slashing weapons."
  },
  {
    "Friendly name": "slave",
    "description": "Slaves are typically untrained fodder who are given weapons and herded into battle. They have low morale and are easily routed. Their morale is improved when led by a taskmaster."
  },
  {
    "Friendly name": "slaver",
    "description": "Gets the capture slave ability. The number of slaves captured will be 1d6+4 (open ended) per month and unrest will increase by 1 for every slave captured."
  },
  {
    "Friendly name": "slaverbonus",
    "description": "Modifies the number of slaves captured with the Slaver ability. E.g. a modifier of -2 will make the slaver ability catch 1d6+2 slaves per month."
  },
  {
    "Friendly name": "sleepaura",
    "description": "Grant the Sleep Aura effect with this area of effect. The Shuten-doji has this ability with area 10."
  },
  {
    "Friendly name": "slimer",
    "description": "Any unit attacking this monster must make a magic resistance check or become immobilized by oozing slime identical to the effects of the Slime spell. Strength works identically to #damagerev."
  },
  {
    "Friendly name": "slothincome",
    "description": "The effect sloth and productivity has on income. Default is 3."
  },
  {
    "Friendly name": "slothpower",
    "description": " The monster will get stat increases or decreases depending on the Sloth scale."
  },
  {
    "Friendly name": "slothresearch",
    "description": "The monster gains"
  },
  {
    "Friendly name": "slothresources",
    "description": "The effect sloth and productivity have on resources. Default is 15."
  },
  {
    "Friendly name": "slowrec",
    "description": "Takes double the amount of commander points to recruit this monster it can only be used on commanders."
  },
  {
    "Friendly name": "snake",
    "description": "Use this for snakes wyrms and other monsters without legs."
  },
  {
    "Friendly name": "snaketattoo",
    "description": "Magic tattoo like the units of Marverni and Sauromatia have."
  },
  {
    "Friendly name": "sneakunit",
    "description": "The item will grant stealth to non-stealthy units."
  },
  {
    "Friendly name": "snow",
    "description": "The monster is unhindered by snow."
  },
  {
    "Friendly name": "sorceryrange",
    "description": "All Sorcery magic (Astral Death Nature Blood) rituals cast in this province have their range increased by"
  },
  {
    "Friendly name": "sound",
    "description": "The sample that will sound when this spell is cast. Samples have the same number as the weapon samples see table Sound effects."
  },
  {
    "Friendly name": "spec",
    "description": "Sets the special abilities of a spell. 8388608 is a useful number and it means that the spell can be cast under water. 64 is armor piercing 128 is armor negating and 4096 means MR negates. Add values together to make combinations."
  },
  {
    "Friendly name": "speciallook",
    "description": "This command surround a monster with a particle effect. Value can be from 1 to 3 and represents fire shield look astral shield look and a burning look respectively. A value of 100 to 199 will give the unit a fixed alpha value of 0-99 (low values will make it impossible to see)."
  },
  {
    "Friendly name": "specstart",
    "description": " Use this command to assign a specific nation to a specific start location. Nation numbers can be found in the Early Era Nations table and the three following tables. If you use the #specstart command"
  },
  {
    "Friendly name": "spell",
    "description": "Enables user of item to cast this spell in battle or as a ritual"
  },
  {
    "Friendly name": "spellreqfly",
    "description": "1 means only flying units can cast this ritual."
  },
  {
    "Friendly name": "spellsinger",
    "description": "Unit takes 50% longer to cast spells but at half fatigue cost."
  },
  {
    "Friendly name": "spiritsight",
    "description": "Spirit sight makes it possible to see into the spirit realm and see the true essence of beings. Units with spirit sight gets no penalties from darkness and can see invisible units."
  },
  {
    "Friendly name": "spr",
    "description": "Uses a user made image for item sprite. The image should be 32x32 or 64x64 with the item centered in the picture. The item itself should not be larger than 40x40 pixels. Black will be transparent unless the image is saved with alpha information in which case that will be used instead."
  },
  {
    "Friendly name": "spr1",
    "description": "The file name of the normal image for the monster. The size of the image should be 8 16 32 64 or 128 pixels wide/high. A human being should be about 32 pixels high and there should be 2 pixels of free space between his feet and the bottom of the image. You can use an alpha channel in the image or not. If not you should instead use black (RGB 0 0 0) as background and magenta (RGB 255 0 255) for shadows."
  },
  {
    "Friendly name": "spr2",
    "description": "The file name of the attack image for the monster. If this is not set then spr1 will be used for this image too."
  },
  {
    "Friendly name": "spreadchaos",
    "description": "The nations dominion spreads Turmoil outside its borders."
  },
  {
    "Friendly name": "spreadcold",
    "description": "The nations dominion spreads Cold outside its borders like Niefelheim."
  },
  {
    "Friendly name": "spreaddeath",
    "description": "The nations dominion spreads Death outside its borders.  NOTE, The value for all scale spread commands can be from 1-3 and indicates the maximum scale value it can raise nearby provinces to as well as the speed with which it spreads."
  },
  {
    "Friendly name": "spreaddom",
    "description": "The monster spreads the Dominion of the pretender god by its mere presence. The candles value should usually be one meaning that the monster spreads as much dominion as one prophet."
  },
  {
    "Friendly name": "spreadheat",
    "description": "The nations dominion spreads Heat outside its borders like Abysia."
  },
  {
    "Friendly name": "spreadlazy",
    "description": "The nations dominion spreads Sloth outside its borders."
  },
  {
    "Friendly name": "springimmortal",
    "description": "The immortal will reform his body in the spring."
  },
  {
    "Friendly name": "springpower",
    "description": "The monster has increased hit points in spring and lowered hit points in autumn."
  },
  {
    "Friendly name": "springshape",
    "description": "Changes into another monster when this season is active."
  },
  {
    "Friendly name": "spy",
    "description": "This monster is a spy."
  },
  {
    "Friendly name": "standard",
    "description": "The monster increases the morale of units in the same squad by"
  },
  {
    "Friendly name": "start",
    "description": " Sets a recommended start location. By creating at least one start location for each player"
  },
  {
    "Friendly name": "startaff",
    "description": "The monster has a chance of starting with a random lesser affliction like a flagellant."
  },
  {
    "Friendly name": "startage",
    "description": "The start age for a monster. Usually there is no need to set this as it will be calculated automatically depending on maxage and skills. An age of zero clears this command and an age of -1 sets start age to zero. The startage value is the starting point for actual age calculations based on magic and other skills."
  },
  {
    "Friendly name": "startcom",
    "description": "The nation will start with this commander. This command also removes all old start troops and must be used when changing start units."
  },
  {
    "Friendly name": "startdom",
    "description": "The default dominion strength this monster is used as a god. Standard is a value between 1 (arch mage) and 4 (oracle). This command also makes the monster selectable as a god."
  },
  {
    "Friendly name": "startheroab",
    "description": "The monster has a chance of starting with a heroic ability like you receive when entering the hall of fame."
  },
  {
    "Friendly name": "startingaff",
    "description": "Monster always starts with one (or more) afflictions as indicated by the affliction bitmask. See the Affliction table in the weapon modding section for suitable values."
  },
  {
    "Friendly name": "startitem",
    "description": "The monster starts with this item if it is a commander."
  },
  {
    "Friendly name": "startmajoraff",
    "description": "The monster has a chance of starting with a random major affliction."
  },
  {
    "Friendly name": "startscout",
    "description": "The nation will start with this unit as an extra commander."
  },
  {
    "Friendly name": "startsite",
    "description": "Adds a start site for this nation. Table Some magic sites shows some suitable start sites. This command can be used up to 4 times for multiple start sites. Assignment by site number is not possible."
  },
  {
    "Friendly name": "startunitnbrs1",
    "description": "The number of start units. Default is 20 units."
  },
  {
    "Friendly name": "startunitnbrs2",
    "description": "The number of start units in the second squad. Default is 20 units."
  },
  {
    "Friendly name": "startunittype1",
    "description": "The commander will have units of this type."
  },
  {
    "Friendly name": "startunittype2",
    "description": "The commander will have a second squad with these units."
  },
  {
    "Friendly name": "stealthboost",
    "description": "The item will grant a stealth bonus to already stealthy units."
  },
  {
    "Friendly name": "stealthcom",
    "description": "The nations that owns the event gains a sneaking commander of the specified type in the province."
  },
  {
    "Friendly name": "stealthy",
    "description": "This monster can sneak into enemy provinces. The default value when using this modding command is 0. Scouts are harder to detect and have a standard value of 10. A Spy has 20. The number of patrolling units required to have a 50% chance of detecting the sneaking monster is"
  },
  {
    "Friendly name": "stonebeing",
    "description": "This monster is a stone being and immune to petrification."
  },
  {
    "Friendly name": "stoneskin",
    "description": "The item automatically applies the Stoneskin spell to the bearer like the Boots of Stone."
  },
  {
    "Friendly name": "stormimmune",
    "description": "The bearer of the can fly during a storm."
  },
  {
    "Friendly name": "stormpower",
    "description": "The monster gets stat increases in combat during storms. This attribute also duplicates the effects of the #stormimmune attribute giving the monster the ability to fly during a storm. Only active in combat."
  },
  {
    "Friendly name": "str",
    "description": "The item grants a strength bonus."
  },
  {
    "Friendly name": "strikeunits",
    "description": "All units in the province are hit with an attack."
  },
  {
    "Friendly name": "succubus",
    "description": "Gives the monster the dream seduction ability like a Succubus. The value indicates the difficulty of the morale check 10 is standard."
  },
  {
    "Friendly name": "summary",
    "description": "A summary of the benefits and dominion themes of the nation."
  },
  {
    "Friendly name": "summerpower",
    "description": "The monster has increased hit points in summer and lowered hit points in winter."
  },
  {
    "Friendly name": "summershape",
    "description": "Changes into another monster when this season is active."
  },
  {
    "Friendly name": "summon",
    "description": "A mage of the same magic path as the site may enter to summon the specified monster. To summon more than one monster of the same type the command must be used multiple times."
  },
  {
    "Friendly name": "summon1",
    "description": "Automatically summons monsters each month. The #summon1 command summons one monster per month and #summon2 to #summon5 more according to the number in the command."
  },
  {
    "Friendly name": "summon2",
    "description": "Automatically summons monsters each month. The #summon1 command summons one monster per month and #summon2 to #summon5 more according to the number in the command."
  },
  {
    "Friendly name": "summon3",
    "description": "Automatically summons monsters each month. The #summon1 command summons one monster per month and #summon2 to #summon5 more according to the number in the command."
  },
  {
    "Friendly name": "summon4",
    "description": "Automatically summons monsters each month. The #summon1 command summons one monster per month and #summon2 to #summon5 more according to the number in the command."
  },
  {
    "Friendly name": "summon5",
    "description": "Automatically summons monsters each month. The #summon1 command summons one monster per month and #summon2 to #summon5 more according to the number in the command."
  },
  {
    "Friendly name": "summonlvl2",
    "description": "Like #summon except that the mage summoning must be at least level 2."
  },
  {
    "Friendly name": "summonlvl3",
    "description": "Like #summon except that the mage summoning must be at least level 3."
  },
  {
    "Friendly name": "summonlvl4",
    "description": "Like #summon except that the mage summoning must be at least level 4."
  },
  {
    "Friendly name": "sunawe",
    "description": "Works like Awe, except that it doesnâ€™t work if there is no sun shining."
  },
  {
    "Friendly name": "supayareanim",
    "description": "Reanimating priest of this nation will create supayas like Nazca."
  },
  {
    "Friendly name": "superiorleader",
    "description": "Leadership value 160. Commander cost +150. Commanded units have a morale modifier of +3."
  },
  {
    "Friendly name": "superiormagicleader",
    "description": "This monster has an innate ability to command 160 magic beings. This is a very rare ability that only most magic beings possess."
  },
  {
    "Friendly name": "superiorundeadleader",
    "description": "This monster has an innate ability to command 160 undead beings. This is a rare ability that usually only demons or undead beings possess."
  },
  {
    "Friendly name": "supply",
    "description": "The magic site provides"
  },
  {
    "Friendly name": "supplybonus",
    "description": "A monster with this ability produces extra supplies. A negative value can also be used which will make the monster consume more supplies than usual."
  },
  {
    "Friendly name": "supplymult",
    "description": "A multiplier for the amount of supplies found in a land. Default is 100."
  },
  {
    "Friendly name": "swampcom",
    "description": "This commander can be recruited in swamp provinces with or without fort. See the box below for all command names."
  },
  {
    "Friendly name": "swamprec",
    "description": "This unit can be recruited in swamp provinces with or without fort. See the box below for all command names."
  },
  {
    "Friendly name": "swampsurvival",
    "description": "Monster has the Swamp Survival skill. Swamp terrain does not hinder movement."
  },
  {
    "Friendly name": "swift",
    "description": "Grants extra combat speed to the wielder."
  },
  {
    "Friendly name": "swimming",
    "description": "The monster can cross rivers."
  },
  {
    "Friendly name": "syncretism",
    "description": "Syncretism enable all priests to convert conquered temples instead of demolishing them."
  },
  {
    "Friendly name": "tainted",
    "description": "Percent chance of being horror marked each turn."
  },
  {
    "Friendly name": "taskmaster",
    "description": "All slaves under the command of this monster have their morale increased by"
  },
  {
    "Friendly name": "taxboost",
    "description": "Tax income increase in the province for one turn. Use negative numbers for a tax decrease. A value of -100 means no gold income for that turn."
  },
  {
    "Friendly name": "taxcollector",
    "description": "The monster can collect taxes from provinces that cannot trace a route to the nearest fort."
  },
  {
    "Friendly name": "teleport",
    "description": "The monster can teleport. Movement on the battlefield is instantaneous and the monster is not hindered by storms. The command automatically sets mapmove to 100 and the creature ignores terrain restrictions and the Sea of Ice spell."
  },
  {
    "Friendly name": "temple",
    "description": " Puts a temple in the active province."
  },
  {
    "Friendly name": "templecost",
    "description": "Gold cost for building a temple. Default is 400."
  },
  {
    "Friendly name": "templegems",
    "description": "The nations temples give gems up to a maximum of current dominion strength. Gem type is a value from 0 to 7 same value as magic paths (0=fire 7=blood)."
  },
  {
    "Friendly name": "templepic",
    "description": "Temple should look like this. See table below for some pic number values."
  },
  {
    "Friendly name": "templetrainer",
    "description": "A commander with this ability will be able to summon a monster per turn when in a temple province. Only one commander can do this per temple province."
  },
  {
    "Friendly name": "tempscalecap",
    "description": "Changing any scale more than this does not yield extra design points. Default value is 3."
  },
  {
    "Friendly name": "tempunits",
    "description": "Units gained after this command are only temporary and disappear after the event has taken place, like the longdead horsemen from the Ghost Riders spell.  1 = temporary units 0 = permanent units"
  },
  {
    "Friendly name": "terrain",
    "description": " Sets the terrain of a province. The terrain is calculated by adding certain numbers for different terrain types or other attributes."
  },
  {
    "Friendly name": "thaucost",
    "description": "All rituals of the Thaumaturgy school cast in this province cost"
  },
  {
    "Friendly name": "thronekill",
    "description": "This monster will automatically destroy thrones in the same province unless they are protected by a fort. Chance is the chance in percent that the throne will be destroyed each turn."
  },
  {
    "Friendly name": "tmpairgems",
    "description": "The monster produces a number of air gems that can be used in combat. The gems are not stable enough to be used for ritual spellcasting."
  },
  {
    "Friendly name": "tmpastralgems",
    "description": "The monster produces a number of astral pearls that can be used in combat. The gems are not stable enough to be used for ritual spellcasting."
  },
  {
    "Friendly name": "tmpbloodslaves",
    "description": "NOT IMPLEMENTED"
  },
  {
    "Friendly name": "tmpdeathgems",
    "description": "The monster produces a number of death gems that can be used in combat. The gems are not stable enough to be used for ritual spellcasting."
  },
  {
    "Friendly name": "tmpearthgems",
    "description": "The monster produces a number of earth gems that can be used in combat. The gems are not stable enough to be used for ritual spellcasting."
  },
  {
    "Friendly name": "tmpfiregems",
    "description": "The monster produces a number of fire gems that can be used in combat. The gems are not stable enough to be used for ritual spellcasting."
  },
  {
    "Friendly name": "tmpnaturegems",
    "description": "The monster produces a number of nature gems that can be used in combat. The gems are not stable enough to be used for ritual spellcasting."
  },
  {
    "Friendly name": "tmpwatergems",
    "description": "The monster produces a number of water gems that can be used in combat. The gems are not stable enough to be used for ritual spellcasting."
  },
  {
    "Friendly name": "tombwyrmreanim",
    "description": "Reanimating priests can reanimate soulless of Ctis longdead of Ctis tomb wyrms and other special Ctissian undead. Desert Tombs Ctis has this attribute."
  },
  {
    "Friendly name": "tradecoast",
    "description": "Income bonus for coastal forts. The nation gains more gold from coastal provinces than another nation with the same fort. Berytos has this ability. The default value is 0."
  },
  {
    "Friendly name": "trample",
    "description": "This monster can trample smaller beings."
  },
  {
    "Friendly name": "trampswallow",
    "description": "The monster automatically swallows the targets of a successful trampling attack. Swallowed monsters are removed from the battlefield until the swallowing monster is killed."
  },
  {
    "Friendly name": "transform",
    "description": "One commander determined by target requirements is transformed into another monster, negative numbers can be used for montags."
  },
  {
    "Friendly name": "transformation",
    "description": "The monster is a possible target for the Transformation spell. Value can be -1 for a bad result 0 to disable and 1 for a good result."
  },
  {
    "Friendly name": "triple3mon",
    "description": "The trinity god has 3 different monsters. The monsters must be created after one another and the first one should be used as the god. Only the first monster needs this command."
  },
  {
    "Friendly name": "triplegod",
    "description": "The pretender is a Trinity God. Splits god into three when game starts. The type value determines how the magic should be split between the 3 pretenders. Type, 1=full magic 2=split magic 3=reduced magic 4=like the grey one 5=like titan of the crossroads."
  },
  {
    "Friendly name": "triplegodmag",
    "description": "Magic penalty for trinity gods when they are not in the same province. The penalty is usually set to 2."
  },
  {
    "Friendly name": "troglodyte",
    "description": "Use this for humanoids without a head."
  },
  {
    "Friendly name": "turmoilevents",
    "description": "How turmoil affects the event frequency. Default is 2."
  },
  {
    "Friendly name": "turmoilincome",
    "description": "The effect turmoil and order has on income. Default is 3."
  },
  {
    "Friendly name": "twiceborn",
    "description": "The monster will get this shape if it dies and rises again due to the twiceborn ritual.  8.13 Monster Summoning"
  },
  {
    "Friendly name": "twohanded",
    "description": "Makes the weapon a two-handed weapon. This means the weapon cannot be combined with a shield if you have only two arms. Two-handed weapons also receive increased bonus damage from strength."
  },
  {
    "Friendly name": "type",
    "description": "Defines whether the item is 1-handed or 2- handed weapon a shield a helmet a body armor a pair of boots or a miscellaneous item. See table Item types."
  },
  {
    "Friendly name": "undcommand",
    "description": "Increases undead leadership by this amount."
  },
  {
    "Friendly name": "undead",
    "description": "This monster is an undead."
  },
  {
    "Friendly name": "undeadimmune",
    "description": "Undead beings are immune to this weapon."
  },
  {
    "Friendly name": "undeadonly",
    "description": "The weapon only affects undead."
  },
  {
    "Friendly name": "undeadreanim",
    "description": "All undead priests of this nation are able to reanimate the dead as if the had the #reanimpriest attribute."
  },
  {
    "Friendly name": "undisciplined",
    "description": "Undisciplined monsters cannot be given orders in battle. They can only deploy in the skirmish formation and will attack the enemy without regard for any battle plan."
  },
  {
    "Friendly name": "undregen",
    "description": "Works like regeneration but only affects undead beings."
  },
  {
    "Friendly name": "unify",
    "description": "Any one of the trinity gods can use the unify order to call the other parts of the trinity."
  },
  {
    "Friendly name": "unique",
    "description": "The item can only be forged once making the item behave like an artifact without being construction level 8."
  },
  {
    "Friendly name": "unit",
    "description": "What type of monster the mercenaries are."
  },
  {
    "Friendly name": "units",
    "description": " Gives a squad of soldiers to the active commander."
  },
  {
    "Friendly name": "unrepel",
    "description": "Attacks with this weapon cannot be repelled."
  },
  {
    "Friendly name": "unrest",
    "description": " Sets the unrest level of the active province."
  },
  {
    "Friendly name": "unresthalfinc",
    "description": "The amount of unrest that cuts income in half. Default is 50."
  },
  {
    "Friendly name": "unresthalfres",
    "description": "The amount of unrest that cuts resources in half. Default is 100."
  },
  {
    "Friendly name": "unsurr",
    "description": "<0 - 1000>  A unit with Unsurroundable will receive a reduced harassment penalty from being attacked multiple times in a round."
  },
  {
    "Friendly name": "unteleportable",
    "description": "The monster cannot use Teleport Gateway or Astral Travel spells to move. It can still use Stygian Paths and Faery Trod."
  },
  {
    "Friendly name": "userestricteditem",
    "description": "The monster can use restricted items of the same value. Value can be 1-10000. See Item Modding for more information."
  },
  {
    "Friendly name": "uwbug",
    "description": "Monsters with this tag are summoned by the Swarm spell underwater."
  },
  {
    "Friendly name": "uwbuild",
    "description": "Determines the ability of a land nation to build forts underwater. A value of 1 means yes."
  },
  {
    "Friendly name": "uwcom",
    "description": "Add a unit to the list of recruitable commanders in underwater forts for this land-based nation. This command can be repeated multiple time for many different commanders."
  },
  {
    "Friendly name": "uwdamage",
    "description": "This monster takes damage equal to the indicated percentage of its total hit points every turn it spends underwater (i.e. in a sea province). Vampires have #uwdamage 100 so they cannot go underwater at all."
  },
  {
    "Friendly name": "uwfireshield",
    "description": "Like fireshield but works underwater too."
  },
  {
    "Friendly name": "uwheat",
    "description": "Like #heat but also works underwater."
  },
  {
    "Friendly name": "uwnation",
    "description": "Underwater nation. The nations capital is in a sea province."
  },
  {
    "Friendly name": "uwok",
    "description": "This ranged weapon can be used underwater and is not affected by storms."
  },
  {
    "Friendly name": "uwrec",
    "description": "Add a unit to the list of recruitable units in underwater forts for this land-based nation. This command can be repeated multiple time for many different units."
  },
  {
    "Friendly name": "uwregen",
    "description": "Works like regeneration but only works underwater."
  },
  {
    "Friendly name": "uwwallcom",
    "description": "Sets wall commander for underwater forts. Works just like the overwater counterpart."
  },
  {
    "Friendly name": "uwwallmult",
    "description": "Modifier for the number of units from the previous #uwwallunit command. Works just like the overwater counterpart."
  },
  {
    "Friendly name": "uwwallunit",
    "description": "Sets wall defenders for underwater forts. Works just like the overwater counterpart."
  },
  {
    "Friendly name": "version",
    "description": "The version number of your mod. E.g. 1.10 or 1.00."
  },
  {
    "Friendly name": "victorycondition",
    "description": " The game will end when one player fulfills a special condition"
  },
  {
    "Friendly name": "victorypoints",
    "description": " The player who has control over this province will control from one to seven victory points. If the province has a fort then the controller of the fort controls the victory points."
  },
  {
    "Friendly name": "visitors",
    "description": "The province is attacked by Bogus the Troll and his Companions."
  },
  {
    "Friendly name": "voidgate",
    "description": "A mage with the same path as the site may enter to summon Void creatures. Void Summoning skill increases the success chance. A mage who does not have the Voidsanity attribute may become insane or feebleminded."
  },
  {
    "Friendly name": "voidret",
    "description": "Extra chance per month of returning from the Void the plane between worlds and the home of horrors and the Void beings of Rlyeh."
  },
  {
    "Friendly name": "voidsanity",
    "description": "The item grants a voidsanity bonus."
  },
  {
    "Friendly name": "walkable",
    "description": "1 = ritual range must trace along a walkable path 0 = ritual range need not be walkable (default)"
  },
  {
    "Friendly name": "wallcom",
    "description": "Commander that is in charge of the wall defenders. There can be multiple of these commands."
  },
  {
    "Friendly name": "wallmult",
    "description": "Modifier for the number of units from the previous #wallunit command. 10 is the standard amount."
  },
  {
    "Friendly name": "wallunit",
    "description": "Unit type the will man the walls when the castle is stormed. There can be multiple of these commands each one should be followed by a #wallmult command."
  },
  {
    "Friendly name": "warning",
    "description": "Increases the amount of bodyguards the commander can have."
  },
  {
    "Friendly name": "wastecom",
    "description": "This commander can be recruited in wasteland provinces with or without fort. See the box below for all command names."
  },
  {
    "Friendly name": "wasterec",
    "description": "This unit can be recruited in wasteland provinces with or without fort. See the box below for all command names."
  },
  {
    "Friendly name": "wastesurvival",
    "description": "Monster has the Waste Survival skill. Waste terrain does not hinder movement."
  },
  {
    "Friendly name": "waterattuned",
    "description": "Chance of getting a bonus level of magic when transformed into this being.  In place of [path] insert the name of the magic path in all lower case for the correct command (#fireattuned #airattuned etc)."
  },
  {
    "Friendly name": "waterblessbonus",
    "description": "Gods of this nation will get extra bless design points of this type."
  },
  {
    "Friendly name": "waterboost",
    "description": "One commander determined by target requirements or the monster number may gain +1 Water magic."
  },
  {
    "Friendly name": "waterbreathing",
    "description": "The item grants water breathing to its bearer."
  },
  {
    "Friendly name": "waterrange",
    "description": "All Water rituals cast in this province have their range increased by"
  },
  {
    "Friendly name": "watershape",
    "description": "The monster changes to this shape when moving from a land province to a water province."
  },
  {
    "Friendly name": "weapon",
    "description": "Defines what kind of a weapon if any the unit gets when it uses the item. Works on misc item boots shield 2-h weapon 1-h weapon. Does not work for helmets or armor. Use #weapon 0 to clear an existing weapon from a copied item."
  },
  {
    "Friendly name": "wightreanim",
    "description": "Reanimating priests with holy magic of level 4 or higher can reanimate undead Lictors. Ashen Empire Ermor has this attribute."
  },
  {
    "Friendly name": "wild",
    "description": "The throne is wild and is likely to be defended by wild monsters."
  },
  {
    "Friendly name": "winterpower",
    "description": "The monster has increased hit points in winter and lowered hit points in summer."
  },
  {
    "Friendly name": "wintershape",
    "description": "Changes into another monster when this season is active."
  },
  {
    "Friendly name": "wolftattoo",
    "description": "Magic tattoo like the units of Marverni and Sauromatia have."
  },
  {
    "Friendly name": "woodenarmor",
    "description": "Indicates that the armor is made of wood."
  },
  {
    "Friendly name": "woodenweapon",
    "description": "The weapon is made of wood."
  },
  {
    "Friendly name": "worldage",
    "description": "Everyone in the world ages this many years. Negative numbers reduce age."
  },
  {
    "Friendly name": "worldcurse",
    "description": "Every unit in the world has a  chance of being cursed."
  },
  {
    "Friendly name": "worlddarkness",
    "description": "The entire world is covered in darkness for this turn."
  },
  {
    "Friendly name": "worlddecscale",
    "description": "Decreases the specified scale in every province in the world by one step."
  },
  {
    "Friendly name": "worlddecscale2",
    "description": "Decreases the specified scale in every province in the world by two steps."
  },
  {
    "Friendly name": "worlddecscale3",
    "description": "Decreases the specified scale in every province in the world by three steps."
  },
  {
    "Friendly name": "worlddisease",
    "description": "Every unit in the world has a  chance of becoming diseased."
  },
  {
    "Friendly name": "worldheal",
    "description": "Each unit in the world has a  chance of having one affliction healed."
  },
  {
    "Friendly name": "worldincdom",
    "description": "Increases dominion in every province in the world by  candles."
  },
  {
    "Friendly name": "worldincscale",
    "description": "Increases the specified scale in every province in the world by one step."
  },
  {
    "Friendly name": "worldincscale2",
    "description": "Increases the specified scale in every province in the world by two steps."
  },
  {
    "Friendly name": "worldincscale3",
    "description": "Increases the specified scale in every province in the world by three steps."
  },
  {
    "Friendly name": "worldmark",
    "description": "Every unit in the world has a  chance of being horrormarked."
  },
  {
    "Friendly name": "worldritrebate",
    "description": "The casting cost of rituals of this school is reduced by 20% for this turn. School numbers are listed in the table below. Worldritrebate can only be used on normal global events (rarity 11 and 12)."
  },
  {
    "Friendly name": "worldunrest",
    "description": "Unrest in every province in the world is increased by . Can be negative to reduce unrest."
  },
  {
    "Friendly name": "woundfend",
    "description": "The monster is less likely to suffer an affliction when taking damage. A value of 1 makes it half as likely a value of 2 makes it one third as likely etc. Air Elementals and similar have a value of 99 making it almost impossible to get an affliction."
  },
  {
    "Friendly name": "xp",
    "description": " Gives experience points to the active commander."
  },
  {
    "Friendly name": "xploss",
    "description": "The monster loses 0-100% of xp when changing shape (e.g. when losing its rider)."
  },
  {
    "Friendly name": "xpshape",
    "description": "The monster will change into the next monster type (next monster number) after reaching this amount of xp."
  },
  {
    "Friendly name": "yearaging",
    "description": "The wielder of this item will age this many extra years each year."
  },
  {
    "Friendly name": "yearturn",
    "description": "Power of the Turning Year. This unit is more powerful during the height of each season and will get increased Strength Attack and Defence during those months."
  },
  {
    "Friendly name": "truesight",
    "description": "Monster has True Sight"
  },
  {
    "Friendly name": "glamourrange",
    "description": "Glamour magic cast by the monster have increased range."
  },
  {
    "Friendly name": "tmpglamourgems",
    "description": "The monster produces a number of glamour gems that can be used in combat. The gems are not stable enough to be used for ritual spellcasting."
  },
  {
    "Friendly name": "aiglamournation",
    "description": "Hint to AI that Glamour magic is used a lot in this nation and that an air god is probably good."
  },
  {
    "Friendly name": "deathshock",
    "description": "The monster erupts in a shock explosion when it dies, inflicting capped 1 AN shock damage to everyone in the area of effect."
  },
  {
    "Friendly name": "deathslime",
    "description": "The monster erupts in a slime explosion when it dies, inflicting slime (water breathers immune) to everyone in the area of effect."
  },
  {
    "Friendly name": "deathgrab",
    "description": "The monster erupts in a earth grip explosion when it dies, inflicting earth grip to everyone in the area of effect."
  },
  {
    "Friendly name": "nightmareaura",
    "description": "Any nearby enemy units will experience horrible visions and take false damage (1 point) if they fail a magic resistance roll. Mindless beings are immune."
  },
  {
    "Friendly name": "falseregen",
    "description": "Heals false damage by this amount of points per combat round."
  },
  {
    "Friendly name": "reconst",
    "description": "Works like regeneration, but only affects inanimate beings."
  },
  {
    "Friendly name": "dread",
    "description": "Fear but negated by True Sight"
  },
  {
    "Friendly name": "fireelementals",
    "description": "Please let me know if you know what this does."
  },
  {
    "Friendly name": "waterelementals",
    "description": "Please let me know if you know what this does."
  },
  {
    "Friendly name": "airelementals",
    "description": "Please let me know if you know what this does."
  },
  {
    "Friendly name": "earthelementals",
    "description": "Please let me know if you know what this does."
  },
  {
    "Friendly name": "undisleader",
    "description": "1=will negate undisciplined on his followers"
  },
  {
    "Friendly name": "assencloc",
    "description": "Specifies an encounter location that the assassinations will appear in. If not specified, a suitable one for each occasion will be used. Possible values can be seen below."
  },
  {
    "Friendly name": "extralives",
    "description": "Will get dominion times this value amount of scar souls (extra lives)"
  },
  {
    "Friendly name": "forestfortrec",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "forestfortcom",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "mountainfortrec",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "mountainfortcom",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "swampfortrec",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "swampfortcom",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "wastefortrec",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "wastefortcom",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "farmfortrec",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "farmfortcom",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "cavefortrec",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "cavefortcom",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "dripfortrec",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "dripfortcom",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "coastfortrec",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "coastfortcom",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "seafortrec",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "seafortcom",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "deepfortrec",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "deepfortcom",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "kelpfortrec",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "kelpfortcom",
    "description": "This unit can be recruited in (terrain) provinces with a fort. "
  },
  {
    "Friendly name": "reqnospellsinger",
    "description": "Units with the spell singing ability cannot cast this spell."
  },
  {
    "Friendly name": "reqnotaskmaster",
    "description": "Units with the task master ability cannot cast this spell"
  },
  {
    "Friendly name": "reqnoseduce",
    "description": "Units with the seduce ability cannot cast this spell"
  },
  {
    "Friendly name": "remount",
    "description": "The commander determined by target requirements regains his mount, should he have lost it."
  },
  {
    "Friendly name": "startresearch",
    "description": "The amount of start research per magic scale above -3. Default is 50 research points."
  },
  {
    "Friendly name": "nodeepchoice",
    "description": "Don't generate caves"
  },
  {
    "Friendly name": "regainmount",
    "description": "If this is set to 1 the rider will regain any lost mount(s) for free after the battle"
  },
  {
    "Friendly name": "noremount",
    "description": "The commander will not be able to reclaim his mount through a reclaim mount order. This is used for certain gods that have divine mounts that must be prayed back"
  },
  {
    "Friendly name": "skilledrider",
    "description": "A skilled rider will increase the Morale and Defence Skill of his mount. The defence increase is most effective on lightly armored horses as it is reduced by the encumbrance value of the mount's armor. This ability should be given to the rider and not to the mount"
  },
  {
    "Friendly name": "mountiscom",
    "description": "If this is set to one the mount is also a commander. This command is used for some gods that have divine mounts."
  },
  {
    "Friendly name": "nobarding",
    "description": "This mount does not have a barding slot. This is used for e.g. the humans that carry a throne with an emperor in it"
  },
  {
    "Friendly name": "nothrowoff",
    "description": "This mount will not throw off its rider if it routs or gets paralyzed. This is used on mounts that are more important than the rider, e.g. elephants, where the rider will never get off voluntarily in order to fight on the ground."
  },
  {
    "Friendly name": "nofalldmg",
    "description": "This rider will not take any damage when falling off his mount. This is used for chariot drivers that are always close to the ground"
  },
  {
    "Friendly name": "bravemount",
    "description": "The chance of the mount remaining on the battlefield and continuing to fight. Default is 0"
  },
  {
    "Friendly name": "smartmount",
    "description": "The smartness determines the chance for the mount to try to make it home. A smart magical unicorn has smartness 100, a normal horse doesn't have this ability at all."
  },
  {
    "Friendly name": "req_pathglamour",
    "description": "There must be a Glamour mage of at least this level in the province"
  },
  {
    "Friendly name": "req_nopathglamour",
    "description": "There cannot be a Glamour mage of this level or higher in the province"
  },
  {
    "Friendly name": "glamourboost",
    "description": "One commander determined by target requirements or the monster number may gain +1 Glamour magic."
  },
  {
    "Friendly name": "killtarg",
    "description": "One commander determined by target requirements is killed. The mount is also killed if any."
  },
  {
    "Friendly name": "mag_glamour",
    "description": "Gives active commander Glamour magic."
  },
  {
    "Friendly name": "selectbless",
    "description": "Selects an existing blessing that will be affected by the following modding commands. End modding this blessing with the #end command"
  },
  {
    "Friendly name": "path0",
    "description": "The path (0-8) required to choose this blessing."
  },
  {
    "Friendly name": "cost0",
    "description": "The minimum skill required in path0 and also the cost in bless points."
  },
  {
    "Friendly name": "path1",
    "description": "An optional secondary path requirement."
  },
  {
    "Friendly name": "cost1",
    "description": "The minimum skill required in path0 and also the cost in bless points."
  },
  {
    "Friendly name": "clearscales",
    "description": "Clear the scale requirements."
  },
  {
    "Friendly name": "clearfx",
    "description": "Clear all effects of this bless"
  }
  
]